[Killed] BlockStatement
src/components/App.js:18:34
 import { store } from '../store';
 import { push } from 'react-router-redux';
 
-const mapStateToProps = state => {
-  return {
-    appLoaded: state.common.appLoaded,
-    appName: state.common.appName,
-    currentUser: state.common.currentUser,
-    redirectTo: state.common.redirectTo
-  }};
+const mapStateToProps = state => {};
 
 const mapDispatchToProps = dispatch => ({
killedBy: App renders loading state (appLoaded=false) — shows header only
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ObjectLiteral
src/components/App.js:19:10
 import { push } from 'react-router-redux';
 
 const mapStateToProps = state => {
-  return {
-    appLoaded: state.common.appLoaded,
-    appName: state.common.appName,
-    currentUser: state.common.currentUser,
-    redirectTo: state.common.redirectTo
-  }};
+  return {}};
 
 const mapDispatchToProps = dispatch => ({
killedBy: App renders loading state (appLoaded=false) — shows header only
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ArrowFunction
src/components/App.js:26:28
     redirectTo: state.common.redirectTo
   }};
 
-const mapDispatchToProps = dispatch => ({
-  onLoad: (payload, token) =>
-    dispatch({ type: APP_LOAD, payload, token, skipTracking: true }),
-  onRedirect: () =>
-    dispatch({ type: REDIRECT })
-});
+const mapDispatchToProps = () => undefined;
 
 class App extends React.Component {
killedBy: App renders loading state (appLoaded=false) — shows header only
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ObjectLiteral
src/components/App.js:26:41
     redirectTo: state.common.redirectTo
   }};
 
-const mapDispatchToProps = dispatch => ({
-  onLoad: (payload, token) =>
-    dispatch({ type: APP_LOAD, payload, token, skipTracking: true }),
-  onRedirect: () =>
-    dispatch({ type: REDIRECT })
-});
+const mapDispatchToProps = dispatch => ({});
 
 class App extends React.Component {
killedBy: App renders loading state (appLoaded=false) — shows header only
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ArrowFunction
src/components/App.js:27:11
   }};
 
 const mapDispatchToProps = dispatch => ({
-  onLoad: (payload, token) =>
-    dispatch({ type: APP_LOAD, payload, token, skipTracking: true }),
+  onLoad: () => undefined,
   onRedirect: () =>
     dispatch({ type: REDIRECT })
killedBy: App reads jwt key from localStorage and dispatches APP_LOAD with skipTracking=true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"skipTracking": true, "token": "myjwt", "type": "APP_LOAD"}

Number of calls: 0

[Killed] BooleanLiteral
src/components/App.js:28:62
 
 const mapDispatchToProps = dispatch => ({
   onLoad: (payload, token) =>
-    dispatch({ type: APP_LOAD, payload, token, skipTracking: true }),
+    dispatch({ type: APP_LOAD, payload, token, skipTracking: false }),
   onRedirect: () =>
     dispatch({ type: REDIRECT })
killedBy: App reads jwt key from localStorage and dispatches APP_LOAD with skipTracking=true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"skipTracking": true, "token": "myjwt", "type": "APP_LOAD"}
Received: {"payload": {}, "skipTracking": false, "token": "myjwt", "type": "APP_LOAD"}

Number of calls: 1

[Killed] ObjectLiteral
src/components/App.js:28:14
 
 const mapDispatchToProps = dispatch => ({
   onLoad: (payload, token) =>
-    dispatch({ type: APP_LOAD, payload, token, skipTracking: true }),
+    dispatch({}),
   onRedirect: () =>
     dispatch({ type: REDIRECT })
killedBy: App renders loading state (appLoaded=false) — shows header only
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] ArrowFunction
src/components/App.js:29:15
 const mapDispatchToProps = dispatch => ({
   onLoad: (payload, token) =>
     dispatch({ type: APP_LOAD, payload, token, skipTracking: true }),
-  onRedirect: () =>
-    dispatch({ type: REDIRECT })
+  onRedirect: () => undefined
 });
 
killedBy: App dispatches REDIRECT via onRedirect when redirectTo is set (covers onRedirect body)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"type": "REDIRECT"}
Received
       1
          Object {
        -   "type": "REDIRECT",
        +   "payload": null,

[Killed] BlockStatement
src/components/App.js:34:40
 });
 
 class App extends React.Component {
-  componentWillReceiveProps(nextProps) {
-    // Stryker disable next-line ConditionalExpression
-    if (nextProps.redirectTo) {
-      // this.context.router.replace(nextProps.redirectTo);
-      store.dispatch(push(nextProps.redirectTo));
-      this.props.onRedirect();
-    }
-  }
+  componentWillReceiveProps(nextProps) {}
 
   componentWillMount() {
killedBy: App dispatches REDIRECT via onRedirect when redirectTo is set (covers onRedirect body)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"type": "REDIRECT"}
Received
       1
          Object {
        -   "type": "REDIRECT",
        +   "payload": null,

[Killed] BlockStatement
src/components/App.js:36:31
 class App extends React.Component {
   componentWillReceiveProps(nextProps) {
     // Stryker disable next-line ConditionalExpression
-    if (nextProps.redirectTo) {
-      // this.context.router.replace(nextProps.redirectTo);
-      store.dispatch(push(nextProps.redirectTo));
-      this.props.onRedirect();
-    }
+    if (nextProps.redirectTo) {}
   }
 
killedBy: App dispatches REDIRECT via onRedirect when redirectTo is set (covers onRedirect body)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"type": "REDIRECT"}
Received
       1
          Object {
        -   "type": "REDIRECT",
        +   "payload": null,

[Killed] BlockStatement
src/components/App.js:43:24
     }
   }
 
-  componentWillMount() {
-    const token = window.localStorage.getItem('jwt');
-    if (token) {
-      agent.setToken(token);
-    }
-
-    this.props.onLoad(token ? agent.Auth.current() : null, token);
-  }
+  componentWillMount() {}
 
   render() {
killedBy: App reads jwt key from localStorage and dispatches APP_LOAD with skipTracking=true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "jwt"

Number of calls: 0

[Killed] BlockStatement
src/components/App.js:45:16
 
   componentWillMount() {
     const token = window.localStorage.getItem('jwt');
-    if (token) {
-      agent.setToken(token);
-    }
+    if (token) {}
 
     this.props.onLoad(token ? agent.Auth.current() : null, token);
killedBy: App reads jwt key from localStorage and dispatches APP_LOAD with skipTracking=true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myjwt"

Number of calls: 0

[Killed] ConditionalExpression
src/components/App.js:45:9
 
   componentWillMount() {
     const token = window.localStorage.getItem('jwt');
-    if (token) {
+    if (false) {
       agent.setToken(token);
     }
killedBy: App reads jwt key from localStorage and dispatches APP_LOAD with skipTracking=true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myjwt"

Number of calls: 0

[Killed] BlockStatement
src/components/App.js:53:31
   }
 
   render() {
-    if (this.props.appLoaded) {
-      return (
-        <div>
-          <Header
-            appName={this.props.appName}
-            currentUser={this.props.currentUser} />
-            <Switch>
-            <Route exact path="/" component={Home}/>
-            <Route path="/login" component={Login} />
-            <Route path="/register" component={Register} />
-            <Route path="/editor/:slug" component={Editor} />
-            <Route path="/editor" component={Editor} />
-            <Route path="/article/:id" component={Article} />
-            <Route path="/settings" component={Settings} />
-            <Route path="/@:username/favorites" component={ProfileFavorites} />
-            <Route path="/@:username" component={Profile} />
-            </Switch>
-        </div>
-      );
-    }
+    if (this.props.appLoaded) {}
     return (
       <div>
killedBy: App renders routes (Switch) when appLoaded=true, not just header
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/components/App.js:53:9
   }
 
   render() {
-    if (this.props.appLoaded) {
+    if (false) {
       return (
         <div>
killedBy: App renders routes (Switch) when appLoaded=true, not just header
statusReason: Error: expect(received).toBeTruthy()

Received: null
