[Killed] ConditionalExpression
src/reducers/auth.js:13:5
 export default (state = {}, action) => {
   switch (action.type) {
     case LOGIN:
-    case REGISTER:
-      return {
-        ...state,
-        inProgress: false,
-        errors: action.error ? action.payload.errors : null
-      };
+    case REGISTER:
     case LOGIN_PAGE_UNLOADED:
     case REGISTER_PAGE_UNLOADED:
killedBy: auth reducer handles LOGIN success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/reducers/auth.js:20:5
         errors: action.error ? action.payload.errors : null
       };
     case LOGIN_PAGE_UNLOADED:
-    case REGISTER_PAGE_UNLOADED:
-      return {};
+    case REGISTER_PAGE_UNLOADED:
     case ASYNC_START:
       if (action.subtype === LOGIN || action.subtype === REGISTER) {
killedBy: auth reducer handles LOGIN_PAGE_UNLOADED
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

- Object {}
+ Object {
+   "email": "a@b.com",

[Killed] ConditionalExpression
src/reducers/auth.js:22:5
     case LOGIN_PAGE_UNLOADED:
     case REGISTER_PAGE_UNLOADED:
       return {};
-    case ASYNC_START:
-      if (action.subtype === LOGIN || action.subtype === REGISTER) {
-        return { ...state, inProgress: true };
-      }
-      break;
+    case ASYNC_START:
     case UPDATE_FIELD_AUTH:
       return { ...state, [action.key]: action.value };
killedBy: auth reducer handles ASYNC_START with LOGIN subtype — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/reducers/auth.js:23:11
     case REGISTER_PAGE_UNLOADED:
       return {};
     case ASYNC_START:
-      if (action.subtype === LOGIN || action.subtype === REGISTER) {
+      if (false) {
         return { ...state, inProgress: true };
       }
killedBy: auth reducer handles ASYNC_START with LOGIN subtype — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/reducers/auth.js:23:11
     case REGISTER_PAGE_UNLOADED:
       return {};
     case ASYNC_START:
-      if (action.subtype === LOGIN || action.subtype === REGISTER) {
+      if (false || action.subtype === REGISTER) {
         return { ...state, inProgress: true };
       }
killedBy: auth reducer handles ASYNC_START with LOGIN subtype — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/reducers/auth.js:24:40
       return {};
     case ASYNC_START:
       if (action.subtype === LOGIN || action.subtype === REGISTER) {
-        return { ...state, inProgress: true };
+        return { ...state, inProgress: false };
       }
       break;
killedBy: auth reducer handles ASYNC_START with LOGIN subtype — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/reducers/auth.js:27:5
         return { ...state, inProgress: true };
       }
       break;
-    case UPDATE_FIELD_AUTH:
-      return { ...state, [action.key]: action.value };
+    case UPDATE_FIELD_AUTH:
+// Stryker disable next-line ConditionalExpression
     // Stryker disable next-line ConditionalExpression
     default:
killedBy: auth reducer handles UPDATE_FIELD_AUTH
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@test.com"
Received: undefined
