[Killed] ArrowFunction
src/components/Article/ArticleActions.js:7:28
 import { connect } from 'react-redux';
 import { DELETE_ARTICLE } from '../../constants/actionTypes';
 
-const mapDispatchToProps = dispatch => ({
-  onClickDelete: payload =>
-    dispatch({ type: DELETE_ARTICLE, payload })
-});
+const mapDispatchToProps = () => undefined;
 
 const ArticleActions = props => {
killedBy: ArticleActions dispatches DELETE_ARTICLE when delete button is clicked
statusReason: TypeError: props.onClickDelete is not a function

[Killed] ArrowFunction
src/components/Article/ArticleActions.js:8:18
 import { DELETE_ARTICLE } from '../../constants/actionTypes';
 
 const mapDispatchToProps = dispatch => ({
-  onClickDelete: payload =>
-    dispatch({ type: DELETE_ARTICLE, payload })
+  onClickDelete: () => undefined
 });
 
killedBy: ArticleActions dispatches DELETE_ARTICLE when delete button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "DELETE_ARTICLE"}

Number of calls: 0

[Killed] BlockStatement
src/components/Article/ArticleActions.js:14:21
 
 const ArticleActions = props => {
   const article = props.article;
-  const del = () => {
-    props.onClickDelete(agent.Articles.del(article.slug))
-  };
+  const del = () => {};
   if (props.canModify) {
     return (
killedBy: ArticleActions dispatches DELETE_ARTICLE when delete button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "DELETE_ARTICLE"}

Number of calls: 0

[Killed] ConditionalExpression
src/components/Article/ArticleActions.js:17:7
   const del = () => {
     props.onClickDelete(agent.Articles.del(article.slug))
   };
-  if (props.canModify) {
+  if (false) {
     return (
       <span>
killedBy: Article canModify=true when currentUser matches author
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Edit Article"
Received string:    "Test Articleauthor1Sun Dec 31 2023Hello world
reactPost Comment"

[Killed] ConditionalExpression
src/components/Article/ArticleActions.js:17:7
   const del = () => {
     props.onClickDelete(agent.Articles.del(article.slug))
   };
-  if (props.canModify) {
+  if (true) {
     return (
       <span>
killedBy: Article canModify=false when currentUser does NOT match author
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Edit Article"
Received string:        "Test Articleauthor1Sun Dec 31 2023 Edit Article Delete ArticleHello world
reactPost Comment"
