[Killed] ArrowFunction
src/agent.js:9:22
 const API_ROOT = 'http://localhost:3000/api';
 
 const encode = encodeURIComponent;
-const responseBody = res => res.body;
+const responseBody = () => undefined;
 
 let token = null;
killedBy: agent Auth current() — GET /user, returns response body
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"ok": true}
Received: undefined

[Killed] BlockStatement
src/agent.js:12:28
 const responseBody = res => res.body;
 
 let token = null;
-const tokenPlugin = req => {
-  if (token) {
-    req.set('authorization', `Token ${token}`);
-  }
-}
+const tokenPlugin = req => {}
 
 const requests = {
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "authorization", "Token mytoken"

Number of calls: 0

[Killed] ConditionalExpression
src/agent.js:13:7
 
 let token = null;
 const tokenPlugin = req => {
-  if (token) {
+  if (true) {
     req.set('authorization', `Token ${token}`);
   }
killedBy: agent setToken works with null token — req.set is never called
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "authorization", "Token null"

[Killed] BlockStatement
src/agent.js:13:14
 
 let token = null;
 const tokenPlugin = req => {
-  if (token) {
-    req.set('authorization', `Token ${token}`);
-  }
+  if (token) {}
 }
 
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "authorization", "Token mytoken"

Number of calls: 0

[Killed] ObjectLiteral
src/agent.js:18:18
   }
 }
 
-const requests = {
-  del: url =>
-    superagent.del(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
-  get: url =>
-    superagent.get(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
-  put: (url, body) =>
-    superagent.put(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody),
-  post: (url, body) =>
-    superagent.post(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody)
-};
+const requests = {};
 
 const Auth = {
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: TypeError: requests.get is not a function

[Killed] ArrowFunction
src/agent.js:19:8
 }
 
 const requests = {
-  del: url =>
-    superagent.del(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
+  del: () => undefined,
   get: url =>
     superagent.get(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
killedBy: agent Articles del() — DELETE /articles/:slug, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:21:8
 const requests = {
   del: url =>
     superagent.del(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
-  get: url =>
-    superagent.get(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
+  get: () => undefined,
   put: (url, body) =>
     superagent.put(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody),
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] ArrowFunction
src/agent.js:23:8
     superagent.del(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
   get: url =>
     superagent.get(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
-  put: (url, body) =>
-    superagent.put(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody),
+  put: () => undefined,
   post: (url, body) =>
     superagent.post(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody)
killedBy: agent Auth save() — PUT /user with wrapped user object, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/user", {"user": {"username": "alice"}}

Number of calls: 0

[Killed] StringLiteral
src/agent.js:24:20
   get: url =>
     superagent.get(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
   put: (url, body) =>
-    superagent.put(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody),
+    superagent.put(``, body).use(tokenPlugin).then(responseBody),
   post: (url, body) =>
     superagent.post(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody)
killedBy: agent Auth save() — PUT /user with wrapped user object, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost:3000/api/user",
+ "",
  {"user": {"username": "alice"}},

[Killed] ArrowFunction
src/agent.js:25:9
     superagent.get(`${API_ROOT}${url}`).use(tokenPlugin).then(responseBody),
   put: (url, body) =>
     superagent.put(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody),
-  post: (url, body) =>
-    superagent.post(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody)
+  post: () => undefined
 };
 
killedBy: agent Auth login() — POST /users/login with credentials, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/users/login", {"user": {"email": "a@b.com", "password": "pass"}}

Number of calls: 0

[Killed] StringLiteral
src/agent.js:26:21
   put: (url, body) =>
     superagent.put(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody),
   post: (url, body) =>
-    superagent.post(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody)
+    superagent.post(``, body).use(tokenPlugin).then(responseBody)
 };
 
killedBy: agent Auth login() — POST /users/login with credentials, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost:3000/api/users/login",
+ "",
  {"user": {"email": "a@b.com", "password": "pass"}},

[Killed] ObjectLiteral
src/agent.js:29:14
     superagent.post(`${API_ROOT}${url}`, body).use(tokenPlugin).then(responseBody)
 };
 
-const Auth = {
-  current: () =>
-    requests.get('/user'),
-  login: (email, password) =>
-    requests.post('/users/login', { user: { email, password } }),
-  register: (username, email, password) =>
-    requests.post('/users', { user: { username, email, password } }),
-  save: user =>
-    requests.put('/user', { user })
-};
+const Auth = {};
 
 const Tags = {
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: TypeError: _agent.default.Auth.current is not a function

[Killed] ArrowFunction
src/agent.js:30:12
 };
 
 const Auth = {
-  current: () =>
-    requests.get('/user'),
+  current: () => undefined,
   login: (email, password) =>
     requests.post('/users/login', { user: { email, password } }),
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] ArrowFunction
src/agent.js:32:10
 const Auth = {
   current: () =>
     requests.get('/user'),
-  login: (email, password) =>
-    requests.post('/users/login', { user: { email, password } }),
+  login: () => undefined,
   register: (username, email, password) =>
     requests.post('/users', { user: { username, email, password } }),
killedBy: agent Auth login() — POST /users/login with credentials, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/users/login", {"user": {"email": "a@b.com", "password": "pass"}}

Number of calls: 0

[Killed] ObjectLiteral
src/agent.js:33:35
   current: () =>
     requests.get('/user'),
   login: (email, password) =>
-    requests.post('/users/login', { user: { email, password } }),
+    requests.post('/users/login', {}),
   register: (username, email, password) =>
     requests.post('/users', { user: { username, email, password } }),
killedBy: agent Auth login() — POST /users/login with credentials, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:3000/api/users/login",
- Object {
-   "user": Object {

[Killed] ArrowFunction
src/agent.js:34:13
     requests.get('/user'),
   login: (email, password) =>
     requests.post('/users/login', { user: { email, password } }),
-  register: (username, email, password) =>
-    requests.post('/users', { user: { username, email, password } }),
+  register: () => undefined,
   save: user =>
     requests.put('/user', { user })
killedBy: agent Auth register() — POST /users with user fields, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/users", {"user": {"email": "a@b.com", "password": "pass", "username": "alice"}}

Number of calls: 0

[Killed] ObjectLiteral
src/agent.js:35:37
   login: (email, password) =>
     requests.post('/users/login', { user: { email, password } }),
   register: (username, email, password) =>
-    requests.post('/users', { user: { username, email, password } }),
+    requests.post('/users', { user: {} }),
   save: user =>
     requests.put('/user', { user })
killedBy: agent Auth register() — POST /users with user fields, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:3000/api/users",
  Object {
-   "user": Object {

[Killed] ArrowFunction
src/agent.js:36:9
     requests.post('/users/login', { user: { email, password } }),
   register: (username, email, password) =>
     requests.post('/users', { user: { username, email, password } }),
-  save: user =>
-    requests.put('/user', { user })
+  save: () => undefined
 };
 
killedBy: agent Auth save() — PUT /user with wrapped user object, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/user", {"user": {"username": "alice"}}

Number of calls: 0

[Killed] ObjectLiteral
src/agent.js:40:14
     requests.put('/user', { user })
 };
 
-const Tags = {
-  getAll: () => requests.get('/tags')
-};
+const Tags = {};
 
 const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
killedBy: agent Tags getAll() — GET /tags, returns response body
statusReason: TypeError: _agent.default.Tags.getAll is not a function

[Killed] ArrowFunction
src/agent.js:41:11
 };
 
 const Tags = {
-  getAll: () => requests.get('/tags')
+  getAll: () => undefined
 };
 
killedBy: agent Tags getAll() — GET /tags, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/tags"

Number of calls: 0

[Killed] StringLiteral
src/agent.js:41:30
 };
 
 const Tags = {
-  getAll: () => requests.get('/tags')
+  getAll: () => requests.get("")
 };
 
killedBy: agent Tags getAll() — GET /tags, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/tags"
Received: "http://localhost:3000/api"

Number of calls: 1

[Killed] ArithmeticOperator
src/agent.js:44:58
   getAll: () => requests.get('/tags')
 };
 
-const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
+const limit = (count, p) => `limit=${count}&offset=${p ? p / count : 0}`;
 const omitSlug = article => Object.assign({}, article, { slug: undefined })
 const Articles = {
killedBy: agent Articles all(2) — page>0 uses p*count for offset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?limit=10&offset=20"
Received: "http://localhost:3000/api/articles?limit=10&offset=0.2"

Number of calls: 1

[Killed] ArrowFunction
src/agent.js:44:15
   getAll: () => requests.get('/tags')
 };
 
-const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
+const limit = () => undefined;
 const omitSlug = article => Object.assign({}, article, { slug: undefined })
 const Articles = {
killedBy: agent Articles all(0) — GET /articles with limit and offset=0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?limit=10&offset=0"
Received: "http://localhost:3000/api/articles?undefined"

Number of calls: 1

[Killed] ArrowFunction
src/agent.js:45:18
 };
 
 const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
-const omitSlug = article => Object.assign({}, article, { slug: undefined })
+const omitSlug = () => undefined
 const Articles = {
   all: page =>
killedBy: agent Articles update() — PUT /articles/:slug with slug omitted from body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:3000/api/articles/my-article",
  Object {
-   "article": Object {

[Killed] ObjectLiteral
src/agent.js:45:56
 };
 
 const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
-const omitSlug = article => Object.assign({}, article, { slug: undefined })
+const omitSlug = article => Object.assign({}, article, {})
 const Articles = {
   all: page =>
killedBy: agent Articles update() — PUT /articles/:slug with slug omitted from body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:3000/api/articles/my-article",
  Object {
    "article": Object {

[Killed] ObjectLiteral
src/agent.js:46:18
 
 const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
 const omitSlug = article => Object.assign({}, article, { slug: undefined })
-const Articles = {
-  all: page =>
-    requests.get(`/articles?${limit(10, page)}`),
-  byAuthor: (author, page) =>
-    requests.get(`/articles?author=${encode(author)}&${limit(5, page)}`),
-  byTag: (tag, page) =>
-    requests.get(`/articles?tag=${encode(tag)}&${limit(10, page)}`),
-  del: slug =>
-    requests.del(`/articles/${slug}`),
-  favorite: slug =>
-    requests.post(`/articles/${slug}/favorite`),
-  favoritedBy: (author, page) =>
-    requests.get(`/articles?favorited=${encode(author)}&${limit(5, page)}`),
-  feed: () =>
-    requests.get('/articles/feed?limit=10&offset=0'),
-  get: slug =>
-    requests.get(`/articles/${slug}`),
-  unfavorite: slug =>
-    requests.del(`/articles/${slug}/favorite`),
-  update: article =>
-    requests.put(`/articles/${article.slug}`, { article: omitSlug(article) }),
-  create: article =>
-    requests.post('/articles', { article })
-};
+const Articles = {};
 
 const Comments = {
killedBy: agent Articles all(0) — GET /articles with limit and offset=0
statusReason: TypeError: _agent.default.Articles.all is not a function

[Killed] ArrowFunction
src/agent.js:47:8
 const limit = (count, p) => `limit=${count}&offset=${p ? p * count : 0}`;
 const omitSlug = article => Object.assign({}, article, { slug: undefined })
 const Articles = {
-  all: page =>
-    requests.get(`/articles?${limit(10, page)}`),
+  all: () => undefined,
   byAuthor: (author, page) =>
     requests.get(`/articles?author=${encode(author)}&${limit(5, page)}`),
killedBy: agent Articles all(0) — GET /articles with limit and offset=0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?limit=10&offset=0"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:49:13
 const Articles = {
   all: page =>
     requests.get(`/articles?${limit(10, page)}`),
-  byAuthor: (author, page) =>
-    requests.get(`/articles?author=${encode(author)}&${limit(5, page)}`),
+  byAuthor: () => undefined,
   byTag: (tag, page) =>
     requests.get(`/articles?tag=${encode(tag)}&${limit(10, page)}`),
killedBy: agent Articles byAuthor() — GET /articles?author=alice with limit/offset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?author=alice&limit=5&offset=0"

Number of calls: 0

[Killed] StringLiteral
src/agent.js:50:18
   all: page =>
     requests.get(`/articles?${limit(10, page)}`),
   byAuthor: (author, page) =>
-    requests.get(`/articles?author=${encode(author)}&${limit(5, page)}`),
+    requests.get(``),
   byTag: (tag, page) =>
     requests.get(`/articles?tag=${encode(tag)}&${limit(10, page)}`),
killedBy: agent Articles byAuthor() — GET /articles?author=alice with limit/offset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?author=alice&limit=5&offset=0"
Received: "http://localhost:3000/api"

Number of calls: 1

[Killed] ArrowFunction
src/agent.js:51:10
     requests.get(`/articles?${limit(10, page)}`),
   byAuthor: (author, page) =>
     requests.get(`/articles?author=${encode(author)}&${limit(5, page)}`),
-  byTag: (tag, page) =>
-    requests.get(`/articles?tag=${encode(tag)}&${limit(10, page)}`),
+  byTag: () => undefined,
   del: slug =>
     requests.del(`/articles/${slug}`),
killedBy: agent Articles byTag() — GET /articles?tag=react with limit/offset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?tag=react&limit=10&offset=0"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:53:8
     requests.get(`/articles?author=${encode(author)}&${limit(5, page)}`),
   byTag: (tag, page) =>
     requests.get(`/articles?tag=${encode(tag)}&${limit(10, page)}`),
-  del: slug =>
-    requests.del(`/articles/${slug}`),
+  del: () => undefined,
   favorite: slug =>
     requests.post(`/articles/${slug}/favorite`),
killedBy: agent Articles del() — DELETE /articles/:slug, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:55:13
     requests.get(`/articles?tag=${encode(tag)}&${limit(10, page)}`),
   del: slug =>
     requests.del(`/articles/${slug}`),
-  favorite: slug =>
-    requests.post(`/articles/${slug}/favorite`),
+  favorite: () => undefined,
   favoritedBy: (author, page) =>
     requests.get(`/articles?favorited=${encode(author)}&${limit(5, page)}`),
killedBy: agent Articles favorite() — POST /articles/:slug/favorite with no body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/favorite", undefined

Number of calls: 0

[Killed] StringLiteral
src/agent.js:56:19
   del: slug =>
     requests.del(`/articles/${slug}`),
   favorite: slug =>
-    requests.post(`/articles/${slug}/favorite`),
+    requests.post(``),
   favoritedBy: (author, page) =>
     requests.get(`/articles?favorited=${encode(author)}&${limit(5, page)}`),
killedBy: agent Articles favorite() — POST /articles/:slug/favorite with no body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/favorite", undefined
Received: "http://localhost:3000/api", undefined

Number of calls: 1

[Killed] ArrowFunction
src/agent.js:57:16
     requests.del(`/articles/${slug}`),
   favorite: slug =>
     requests.post(`/articles/${slug}/favorite`),
-  favoritedBy: (author, page) =>
-    requests.get(`/articles?favorited=${encode(author)}&${limit(5, page)}`),
+  favoritedBy: () => undefined,
   feed: () =>
     requests.get('/articles/feed?limit=10&offset=0'),
killedBy: agent Articles favoritedBy() — GET /articles?favorited=alice with limit/offset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles?favorited=alice&limit=5&offset=0"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:59:9
     requests.post(`/articles/${slug}/favorite`),
   favoritedBy: (author, page) =>
     requests.get(`/articles?favorited=${encode(author)}&${limit(5, page)}`),
-  feed: () =>
-    requests.get('/articles/feed?limit=10&offset=0'),
+  feed: () => undefined,
   get: slug =>
     requests.get(`/articles/${slug}`),
killedBy: agent Articles feed() — GET /articles/feed with fixed limit and offset
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/feed?limit=10&offset=0"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:61:8
     requests.get(`/articles?favorited=${encode(author)}&${limit(5, page)}`),
   feed: () =>
     requests.get('/articles/feed?limit=10&offset=0'),
-  get: slug =>
-    requests.get(`/articles/${slug}`),
+  get: () => undefined,
   unfavorite: slug =>
     requests.del(`/articles/${slug}/favorite`),
killedBy: agent Articles get() — GET /articles/:slug, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article"

Number of calls: 0

[Killed] StringLiteral
src/agent.js:62:18
   feed: () =>
     requests.get('/articles/feed?limit=10&offset=0'),
   get: slug =>
-    requests.get(`/articles/${slug}`),
+    requests.get(``),
   unfavorite: slug =>
     requests.del(`/articles/${slug}/favorite`),
killedBy: agent Articles get() — GET /articles/:slug, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article"
Received: "http://localhost:3000/api"

Number of calls: 1

[Killed] ArrowFunction
src/agent.js:63:15
     requests.get('/articles/feed?limit=10&offset=0'),
   get: slug =>
     requests.get(`/articles/${slug}`),
-  unfavorite: slug =>
-    requests.del(`/articles/${slug}/favorite`),
+  unfavorite: () => undefined,
   update: article =>
     requests.put(`/articles/${article.slug}`, { article: omitSlug(article) }),
killedBy: agent Articles unfavorite() — DELETE /articles/:slug/favorite
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/favorite"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:65:11
     requests.get(`/articles/${slug}`),
   unfavorite: slug =>
     requests.del(`/articles/${slug}/favorite`),
-  update: article =>
-    requests.put(`/articles/${article.slug}`, { article: omitSlug(article) }),
+  update: () => undefined,
   create: article =>
     requests.post('/articles', { article })
killedBy: agent Articles update() — PUT /articles/:slug with slug omitted from body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article", {"article": {"slug": undefined, "tagList": [], "title": "New"}}

Number of calls: 0

[Killed] StringLiteral
src/agent.js:66:18
   unfavorite: slug =>
     requests.del(`/articles/${slug}/favorite`),
   update: article =>
-    requests.put(`/articles/${article.slug}`, { article: omitSlug(article) }),
+    requests.put(``, { article: omitSlug(article) }),
   create: article =>
     requests.post('/articles', { article })
killedBy: agent Articles update() — PUT /articles/:slug with slug omitted from body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost:3000/api/articles/my-article",
+ "http://localhost:3000/api",
  {"article": {"slug": undefined, "tagList": [], "title": "New"}},

[Killed] ObjectLiteral
src/agent.js:66:47
   unfavorite: slug =>
     requests.del(`/articles/${slug}/favorite`),
   update: article =>
-    requests.put(`/articles/${article.slug}`, { article: omitSlug(article) }),
+    requests.put(`/articles/${article.slug}`, {}),
   create: article =>
     requests.post('/articles', { article })
killedBy: agent Articles update() — PUT /articles/:slug with slug omitted from body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://localhost:3000/api/articles/my-article",
- Object {
-   "article": Object {

[Killed] ArrowFunction
src/agent.js:67:11
     requests.del(`/articles/${slug}/favorite`),
   update: article =>
     requests.put(`/articles/${article.slug}`, { article: omitSlug(article) }),
-  create: article =>
-    requests.post('/articles', { article })
+  create: () => undefined
 };
 
killedBy: agent Articles create() — POST /articles with article body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles", {"article": {"tagList": [], "title": "New Article"}}

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:72:11
 };
 
 const Comments = {
-  create: (slug, comment) =>
-    requests.post(`/articles/${slug}/comments`, { comment }),
+  create: () => undefined,
   delete: (slug, commentId) =>
     requests.del(`/articles/${slug}/comments/${commentId}`),
killedBy: agent Comments create() — POST /articles/:slug/comments with comment body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/comments", {"comment": {"body": "great!"}}

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:74:11
 const Comments = {
   create: (slug, comment) =>
     requests.post(`/articles/${slug}/comments`, { comment }),
-  delete: (slug, commentId) =>
-    requests.del(`/articles/${slug}/comments/${commentId}`),
+  delete: () => undefined,
   forArticle: slug =>
     requests.get(`/articles/${slug}/comments`)
killedBy: agent Comments delete() — DELETE /articles/:slug/comments/:id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/comments/42"

Number of calls: 0

[Killed] StringLiteral
src/agent.js:75:18
   create: (slug, comment) =>
     requests.post(`/articles/${slug}/comments`, { comment }),
   delete: (slug, commentId) =>
-    requests.del(`/articles/${slug}/comments/${commentId}`),
+    requests.del(``),
   forArticle: slug =>
     requests.get(`/articles/${slug}/comments`)
killedBy: agent Comments delete() — DELETE /articles/:slug/comments/:id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/comments/42"
Received: "http://localhost:3000/api"

Number of calls: 1

[Killed] ArrowFunction
src/agent.js:76:15
     requests.post(`/articles/${slug}/comments`, { comment }),
   delete: (slug, commentId) =>
     requests.del(`/articles/${slug}/comments/${commentId}`),
-  forArticle: slug =>
-    requests.get(`/articles/${slug}/comments`)
+  forArticle: () => undefined
 };
 
killedBy: agent Comments forArticle() — GET /articles/:slug/comments
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/articles/my-article/comments"

Number of calls: 0

[Killed] ObjectLiteral
src/agent.js:80:17
     requests.get(`/articles/${slug}/comments`)
 };
 
-const Profile = {
-  follow: username =>
-    requests.post(`/profiles/${username}/follow`),
-  get: username =>
-    requests.get(`/profiles/${username}`),
-  unfollow: username =>
-    requests.del(`/profiles/${username}/follow`)
-};
+const Profile = {};
 
 export default {
killedBy: agent Profile follow() — POST /profiles/:username/follow with no body
statusReason: TypeError: _agent.default.Profile.follow is not a function

[Killed] ArrowFunction
src/agent.js:81:11
 };
 
 const Profile = {
-  follow: username =>
-    requests.post(`/profiles/${username}/follow`),
+  follow: () => undefined,
   get: username =>
     requests.get(`/profiles/${username}`),
killedBy: agent Profile follow() — POST /profiles/:username/follow with no body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/profiles/alice/follow", undefined

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:83:8
 const Profile = {
   follow: username =>
     requests.post(`/profiles/${username}/follow`),
-  get: username =>
-    requests.get(`/profiles/${username}`),
+  get: () => undefined,
   unfollow: username =>
     requests.del(`/profiles/${username}/follow`)
killedBy: agent Profile get() — GET /profiles/:username, returns response body
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/profiles/alice"

Number of calls: 0

[Killed] ArrowFunction
src/agent.js:85:13
     requests.post(`/profiles/${username}/follow`),
   get: username =>
     requests.get(`/profiles/${username}`),
-  unfollow: username =>
-    requests.del(`/profiles/${username}/follow`)
+  unfollow: () => undefined
 };
 
killedBy: agent Profile unfollow() — DELETE /profiles/:username/follow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:3000/api/profiles/alice/follow"

Number of calls: 0

[Killed] BlockStatement
src/agent.js:95:23
   Comments,
   Profile,
   Tags,
-  setToken: _token => { token = _token; }
+  setToken: _token => {}
 };
 
killedBy: agent setToken sets the auth token — req.set called with correct Authorization header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "authorization", "Token mytoken"

Number of calls: 0
