[Killed] ArrowFunction
src/components/Article/CommentInput.js:7:28
 import { ADD_COMMENT } from '../../constants/actionTypes';
 import UserImage from '../UserImage';
 
-const mapDispatchToProps = dispatch => ({
-  onSubmit: payload =>
-    dispatch({ type: ADD_COMMENT, payload })
-});
+const mapDispatchToProps = () => undefined;
 
 class CommentInput extends React.Component {
killedBy: CommentInput submits comment and resets body on form submit
statusReason: TypeError: _this.props.onSubmit is not a function

[Killed] ArrowFunction
src/components/Article/CommentInput.js:8:13
 import UserImage from '../UserImage';
 
 const mapDispatchToProps = dispatch => ({
-  onSubmit: payload =>
-    dispatch({ type: ADD_COMMENT, payload })
+  onSubmit: () => undefined
 });
 
killedBy: CommentInput dispatches ADD_COMMENT with correct payload on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "ADD_COMMENT"}

Number of calls: 0

[Killed] BlockStatement
src/components/Article/CommentInput.js:13:17
 });
 
 class CommentInput extends React.Component {
-  constructor() {
-    super();
-    // Stryker disable next-line ObjectLiteral
-    this.state = {
-      body: ''
-    };
-
-    this.setBody = ev => {
-      this.setState({ body: ev.target.value });
-    };
-
-    this.createComment = ev => {
-      ev.preventDefault();
-      const payload = agent.Comments.create(this.props.slug,
-        { body: this.state.body });
-      this.setState({ body: '' });
-      this.props.onSubmit(payload);
-    };
-  }
+  constructor() {}
 
   render() {
killedBy: Article canModify=true when currentUser matches author
statusReason: ReferenceError: this hasn't been initialised - super() hasn't been called

[Killed] StringLiteral
src/components/Article/CommentInput.js:17:13
     super();
     // Stryker disable next-line ObjectLiteral
     this.state = {
-      body: ''
+      body: "Stryker was here!"
     };
 
killedBy: CommentInput textarea initial value is empty string (initial state body="")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/components/Article/CommentInput.js:20:26
       body: ''
     };
 
-    this.setBody = ev => {
-      this.setState({ body: ev.target.value });
-    };
+    this.setBody = ev => {};
 
     this.createComment = ev => {
killedBy: CommentInput updates textarea value on change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello comment"
Received: ""

[Killed] BlockStatement
src/components/Article/CommentInput.js:24:32
       this.setState({ body: ev.target.value });
     };
 
-    this.createComment = ev => {
-      ev.preventDefault();
-      const payload = agent.Comments.create(this.props.slug,
-        { body: this.state.body });
-      this.setState({ body: '' });
-      this.props.onSubmit(payload);
-    };
+    this.createComment = ev => {};
   }
 
killedBy: CommentInput submits comment and resets body on form submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug", {"body": "my comment"}

Number of calls: 0

[Killed] ObjectLiteral
src/components/Article/CommentInput.js:27:9
     this.createComment = ev => {
       ev.preventDefault();
       const payload = agent.Comments.create(this.props.slug,
-        { body: this.state.body });
+        {});
       this.setState({ body: '' });
       this.props.onSubmit(payload);
killedBy: CommentInput submits comment and resets body on form submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "test-slug",
- Object {
-   "body": "my comment",

[Killed] ObjectLiteral
src/components/Article/CommentInput.js:28:21
       ev.preventDefault();
       const payload = agent.Comments.create(this.props.slug,
         { body: this.state.body });
-      this.setState({ body: '' });
+      this.setState({});
       this.props.onSubmit(payload);
     };
killedBy: CommentInput body resets to empty string after submit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "typed comment"

[Killed] StringLiteral
src/components/Article/CommentInput.js:28:29
       ev.preventDefault();
       const payload = agent.Comments.create(this.props.slug,
         { body: this.state.body });
-      this.setState({ body: '' });
+      this.setState({ body: "Stryker was here!" });
       this.props.onSubmit(payload);
     };
killedBy: CommentInput body resets to empty string after submit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/components/Article/CommentInput.js:33:12
     };
   }
 
-  render() {
-    return (
-      <form className="card comment-form" onSubmit={this.createComment}>
-        <div className="card-block">
-          <textarea className="form-control"
-            placeholder="Write a comment..."
-            value={this.state.body}
-            onChange={this.setBody}
-            rows="3">
-          </textarea>
-        </div>
-        <div className="card-footer">
-          <UserImage
-            src={this.props.currentUser.image}
-            username={this.props.currentUser.username}
-            className="comment-author-img" />
-          <button
-            className="btn btn-sm btn-primary"
-            type="submit">
-            Post Comment
-          </button>
-        </div>
-      </form>
-    );
-  }
+  render() {}
 }
 
killedBy: CommentInput renders comment form
statusReason: Error: CommentInput(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
