[Killed] ArrowFunction
src/components/Login.js:14:28
 
 const mapStateToProps = state => ({ ...state.auth });
 
-const mapDispatchToProps = dispatch => ({
-  onChangeEmail: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
-  onChangePassword: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
-  onSubmit: (email, password) =>
-    dispatch({ type: LOGIN, payload: agent.Auth.login(email, password) }),
-  onUnload: () =>
-    dispatch({ type: LOGIN_PAGE_UNLOADED })
-});
+const mapDispatchToProps = () => undefined;
 
 class Login extends React.Component {
killedBy: Login submits form and calls agent.Auth.login
statusReason: TypeError: _this.props.onSubmit is not a function

[Killed] ObjectLiteral
src/components/Login.js:14:41
 
 const mapStateToProps = state => ({ ...state.auth });
 
-const mapDispatchToProps = dispatch => ({
-  onChangeEmail: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
-  onChangePassword: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
-  onSubmit: (email, password) =>
-    dispatch({ type: LOGIN, payload: agent.Auth.login(email, password) }),
-  onUnload: () =>
-    dispatch({ type: LOGIN_PAGE_UNLOADED })
-});
+const mapDispatchToProps = dispatch => ({});
 
 class Login extends React.Component {
killedBy: Login submits form and calls agent.Auth.login
statusReason: TypeError: _this.props.onSubmit is not a function

[Killed] ArrowFunction
src/components/Login.js:19:13
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
   onChangePassword: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
-  onSubmit: (email, password) =>
-    dispatch({ type: LOGIN, payload: agent.Auth.login(email, password) }),
+  onSubmit: () => undefined,
   onUnload: () =>
     dispatch({ type: LOGIN_PAGE_UNLOADED })
killedBy: Login submits form and calls agent.Auth.login
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/components/Login.js:20:14
   onChangePassword: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
   onSubmit: (email, password) =>
-    dispatch({ type: LOGIN, payload: agent.Auth.login(email, password) }),
+    dispatch({}),
   onUnload: () =>
     dispatch({ type: LOGIN_PAGE_UNLOADED })
killedBy: Login submits form and calls agent.Auth.login
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] ArrowFunction
src/components/Login.js:21:13
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
   onSubmit: (email, password) =>
     dispatch({ type: LOGIN, payload: agent.Auth.login(email, password) }),
-  onUnload: () =>
-    dispatch({ type: LOGIN_PAGE_UNLOADED })
+  onUnload: () => undefined
 });
 
killedBy: Login dispatches LOGIN_PAGE_UNLOADED on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"type": "LOGIN_PAGE_UNLOADED"}

Number of calls: 0

[Killed] BlockStatement
src/components/Login.js:26:17
 });
 
 class Login extends React.Component {
-  constructor() {
-    super();
-    this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
-    this.changePassword = ev => this.props.onChangePassword(ev.target.value);
-    this.submitForm = (email, password) => ev => {
-      ev.preventDefault();
-      this.props.onSubmit(email, password);
-    };
-  }
+  constructor() {}
 
   componentWillUnmount() {
killedBy: Login renders login form
statusReason: ReferenceError: this hasn't been initialised - super() hasn't been called

[Killed] BlockStatement
src/components/Login.js:30:50
     super();
     this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
     this.changePassword = ev => this.props.onChangePassword(ev.target.value);
-    this.submitForm = (email, password) => ev => {
-      ev.preventDefault();
-      this.props.onSubmit(email, password);
-    };
+    this.submitForm = (email, password) => ev => {};
   }
 
killedBy: Login submits form and calls agent.Auth.login
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/components/Login.js:30:23
     super();
     this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
     this.changePassword = ev => this.props.onChangePassword(ev.target.value);
-    this.submitForm = (email, password) => ev => {
-      ev.preventDefault();
-      this.props.onSubmit(email, password);
-    };
+    this.submitForm = () => undefined;
   }
 
killedBy: Login submits form and calls agent.Auth.login
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
