[Killed] ArrowFunction
src/components/Article/DeleteButton.js:6:28
 import { connect } from 'react-redux';
 import { DELETE_COMMENT } from '../../constants/actionTypes';
 
-const mapDispatchToProps = dispatch => ({
-  onClick: (payload, commentId) =>
-    dispatch({ type: DELETE_COMMENT, payload, commentId })
-});
+const mapDispatchToProps = () => undefined;
 
 const DeleteButton = props => {
killedBy: DeleteButton triggers click on delete icon without throwing
statusReason: TypeError: props.onClick is not a function

[Killed] ArrowFunction
src/components/Article/DeleteButton.js:7:12
 import { DELETE_COMMENT } from '../../constants/actionTypes';
 
 const mapDispatchToProps = dispatch => ({
-  onClick: (payload, commentId) =>
-    dispatch({ type: DELETE_COMMENT, payload, commentId })
+  onClick: () => undefined
 });
 
killedBy: DeleteButton dispatches DELETE_COMMENT with commentId when trash icon is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"commentId": 42, "type": "DELETE_COMMENT"}

Number of calls: 0

[Killed] ObjectLiteral
src/components/Article/DeleteButton.js:8:14
 
 const mapDispatchToProps = dispatch => ({
   onClick: (payload, commentId) =>
-    dispatch({ type: DELETE_COMMENT, payload, commentId })
+    dispatch({})
 });
 
killedBy: DeleteButton triggers click on delete icon without throwing
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] BlockStatement
src/components/Article/DeleteButton.js:11:31
     dispatch({ type: DELETE_COMMENT, payload, commentId })
 });
 
-const DeleteButton = props => {
-  const del = () => {
-    const payload = agent.Comments.delete(props.slug, props.commentId);
-    props.onClick(payload, props.commentId);
-  };
-
-  if (props.show) {
-    return (
-      <span className="mod-options">
-        <i className="ion-trash-a" onClick={del}></i>
-      </span>
-    );
-  }
-  return null;
-};
+const DeleteButton = props => {};
 
 // Stryker disable next-line ArrowFunction
killedBy: Comment renders comment body and author
statusReason: Error: DeleteButton(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Article/DeleteButton.js:12:21
 });
 
 const DeleteButton = props => {
-  const del = () => {
-    const payload = agent.Comments.delete(props.slug, props.commentId);
-    props.onClick(payload, props.commentId);
-  };
+  const del = () => {};
 
   if (props.show) {
killedBy: DeleteButton dispatches DELETE_COMMENT with commentId when trash icon is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"commentId": 42, "type": "DELETE_COMMENT"}

Number of calls: 0

[Killed] BlockStatement
src/components/Article/DeleteButton.js:17:19
     props.onClick(payload, props.commentId);
   };
 
-  if (props.show) {
-    return (
-      <span className="mod-options">
-        <i className="ion-trash-a" onClick={del}></i>
-      </span>
-    );
-  }
+  if (props.show) {}
   return null;
 };
killedBy: Comment shows delete button when currentUser is the author
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/components/Article/DeleteButton.js:17:7
     props.onClick(payload, props.commentId);
   };
 
-  if (props.show) {
+  if (true) {
     return (
       <span className="mod-options">
killedBy: Comment hides delete button when currentUser is not the author
statusReason: Error: expect(received).toBeNull()

Received: <span class="mod-options"><i class="ion-trash-a" /></span>
