[Killed] StringLiteral
src/components/ArticlePreview.js:8:25
 import { connect } from 'react-redux';
 import { ARTICLE_FAVORITED, ARTICLE_UNFAVORITED } from '../constants/actionTypes';
 
-const FAVORITED_CLASS = 'btn btn-sm btn-primary';
+const FAVORITED_CLASS = "";
 const NOT_FAVORITED_CLASS = 'btn btn-sm btn-outline-primary';
 
killedBy: ArticlePreview renders favorited button when favorited=true
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "btn-primary"
Received string:    ""

[Killed] ArrowFunction
src/components/ArticlePreview.js:11:28
 const FAVORITED_CLASS = 'btn btn-sm btn-primary';
 const NOT_FAVORITED_CLASS = 'btn btn-sm btn-outline-primary';
 
-const mapDispatchToProps = dispatch => ({
-  favorite: slug => dispatch({
-    type: ARTICLE_FAVORITED,
-    payload: agent.Articles.favorite(slug)
-  }),
-  unfavorite: slug => dispatch({
-    type: ARTICLE_UNFAVORITED,
-    payload: agent.Articles.unfavorite(slug)
-  })
-});
+const mapDispatchToProps = () => undefined;
 
 const ArticlePreview = props => {
killedBy: ArticlePreview calls unfavorite when clicking on a favorited article
statusReason: TypeError: props.unfavorite is not a function

[Killed] ArrowFunction
src/components/ArticlePreview.js:12:13
 const NOT_FAVORITED_CLASS = 'btn btn-sm btn-outline-primary';
 
 const mapDispatchToProps = dispatch => ({
-  favorite: slug => dispatch({
-    type: ARTICLE_FAVORITED,
-    payload: agent.Articles.favorite(slug)
-  }),
+  favorite: () => undefined,
   unfavorite: slug => dispatch({
     type: ARTICLE_UNFAVORITED,
killedBy: ArticlePreview calls favorite when clicking on a non-favorited article
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug"

Number of calls: 0

[Killed] ArrowFunction
src/components/ArticlePreview.js:16:15
     type: ARTICLE_FAVORITED,
     payload: agent.Articles.favorite(slug)
   }),
-  unfavorite: slug => dispatch({
-    type: ARTICLE_UNFAVORITED,
-    payload: agent.Articles.unfavorite(slug)
-  })
+  unfavorite: () => undefined
 });
 
killedBy: ArticlePreview calls unfavorite when clicking on a favorited article
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug"

Number of calls: 0

[Killed] BlockStatement
src/components/ArticlePreview.js:28:29
     FAVORITED_CLASS :
     NOT_FAVORITED_CLASS;
 
-  const handleClick = ev => {
-    ev.preventDefault();
-    if (article.favorited) {
-      props.unfavorite(article.slug);
-    } else {
-      props.favorite(article.slug);
-    }
-  };
+  const handleClick = ev => {};
 
   return (
killedBy: ArticlePreview calls unfavorite when clicking on a favorited article
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug"

Number of calls: 0

[Killed] ConditionalExpression
src/components/ArticlePreview.js:30:9
 
   const handleClick = ev => {
     ev.preventDefault();
-    if (article.favorited) {
+    if (false) {
       props.unfavorite(article.slug);
     } else {
killedBy: ArticlePreview calls unfavorite when clicking on a favorited article
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug"

Number of calls: 0

[Killed] BlockStatement
src/components/ArticlePreview.js:30:28
 
   const handleClick = ev => {
     ev.preventDefault();
-    if (article.favorited) {
-      props.unfavorite(article.slug);
-    } else {
+    if (article.favorited) {} else {
       props.favorite(article.slug);
     }
killedBy: ArticlePreview calls unfavorite when clicking on a favorited article
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug"

Number of calls: 0

[Killed] BlockStatement
src/components/ArticlePreview.js:32:12
     ev.preventDefault();
     if (article.favorited) {
       props.unfavorite(article.slug);
-    } else {
-      props.favorite(article.slug);
-    }
+    } else {}
   };
 
killedBy: ArticlePreview calls favorite when clicking on a non-favorited article
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-slug"

Number of calls: 0

[Survived] StringLiteral
src/components/ArticlePreview.js:47:40
 
         <div className="info">
           {/* Stryker disable next-line StringLiteral */}
-          <Link className="author" to={`/@${article.author.username}`}>
+          <Link className="author" to={``}>
             {article.author.username}
           </Link>

[Survived] StringLiteral
src/components/ArticlePreview.js:63:17
       </div>
 
       {/* Stryker disable next-line StringLiteral */}
-      <Link to={`/article/${article.slug}`} className="preview-link">
+      <Link to={``} className="preview-link">
         <h1>{article.title}</h1>
         <p>{article.description}</p>

[Killed] BlockStatement
src/components/ArticlePreview.js:69:40
         <span>Read more...</span>
         <ul className="tag-list">
           {
-            article.tagList.map(tag => {
-              return (
-                <li className="tag-default tag-pill tag-outline" key={tag}>
-                  {tag}
-                </li>
-              )
-            })
+            article.tagList.map(tag => {})
           }
         </ul>
killedBy: ArticlePreview renders tags
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "react"
Received string:    "testuserSun Dec 31 2023 5Test TitleTest descriptionRead more..."
