[Killed] ArrowFunction
src/components/Editor.js:14:25
   UPDATE_FIELD_EDITOR
 } from '../constants/actionTypes';
 
-const mapStateToProps = state => ({
-  ...state.editor
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = dispatch => ({
killedBy: Editor (connected) dispatches REMOVE_TAG with tag when remove icon is clicked
statusReason: TypeError: Cannot read properties of null (reading '__reactInternalInstance$y47w4o3r7c')

[Killed] ObjectLiteral
src/components/Editor.js:14:35
   UPDATE_FIELD_EDITOR
 } from '../constants/actionTypes';
 
-const mapStateToProps = state => ({
-  ...state.editor
-});
+const mapStateToProps = state => ({});
 
 const mapDispatchToProps = dispatch => ({
killedBy: Editor (connected) dispatches REMOVE_TAG with tag when remove icon is clicked
statusReason: TypeError: Cannot read properties of null (reading '__reactInternalInstance$ie5rmi5rvxm')

[Killed] ArrowFunction
src/components/Editor.js:18:28
   ...state.editor
 });
 
-const mapDispatchToProps = dispatch => ({
-  onAddTag: () =>
-    dispatch({ type: ADD_TAG }),
-  onLoad: payload =>
-    dispatch({ type: EDITOR_PAGE_LOADED, payload }),
-  onRemoveTag: tag =>
-    dispatch({ type: REMOVE_TAG, tag }),
-  onSubmit: payload =>
-    dispatch({ type: ARTICLE_SUBMITTED, payload }),
-  onUnload: payload =>
-    dispatch({ type: EDITOR_PAGE_UNLOADED }),
-  onUpdateField: (key, value) =>
-    dispatch({ type: UPDATE_FIELD_EDITOR, key, value })
-});
+const mapDispatchToProps = () => undefined;
 
 class Editor extends React.Component {
killedBy: Editor (connected) renders without crashing
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ArrowFunction
src/components/Editor.js:19:13
 });
 
 const mapDispatchToProps = dispatch => ({
-  onAddTag: () =>
-    dispatch({ type: ADD_TAG }),
+  onAddTag: () => undefined,
   onLoad: payload =>
     dispatch({ type: EDITOR_PAGE_LOADED, payload }),
killedBy: Editor (connected) dispatches ADD_TAG when Enter is pressed in tag input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "type": "ADD_TAG",
+   "payload": null,

[Killed] ObjectLiteral
src/components/Editor.js:20:14
 
 const mapDispatchToProps = dispatch => ({
   onAddTag: () =>
-    dispatch({ type: ADD_TAG }),
+    dispatch({}),
   onLoad: payload =>
     dispatch({ type: EDITOR_PAGE_LOADED, payload }),
killedBy: Editor (connected) dispatches ADD_TAG when Enter is pressed in tag input
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] ArrowFunction
src/components/Editor.js:21:11
 const mapDispatchToProps = dispatch => ({
   onAddTag: () =>
     dispatch({ type: ADD_TAG }),
-  onLoad: payload =>
-    dispatch({ type: EDITOR_PAGE_LOADED, payload }),
+  onLoad: () => undefined,
   onRemoveTag: tag =>
     dispatch({ type: REMOVE_TAG, tag }),
killedBy: Editor (connected) dispatches EDITOR_PAGE_LOADED on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "EDITOR_PAGE_LOADED"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Editor.js:23:16
     dispatch({ type: ADD_TAG }),
   onLoad: payload =>
     dispatch({ type: EDITOR_PAGE_LOADED, payload }),
-  onRemoveTag: tag =>
-    dispatch({ type: REMOVE_TAG, tag }),
+  onRemoveTag: () => undefined,
   onSubmit: payload =>
     dispatch({ type: ARTICLE_SUBMITTED, payload }),
killedBy: Editor (connected) dispatches REMOVE_TAG with tag when remove icon is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "tag": "react",
-   "type": "REMOVE_TAG",

[Killed] ArrowFunction
src/components/Editor.js:25:13
     dispatch({ type: EDITOR_PAGE_LOADED, payload }),
   onRemoveTag: tag =>
     dispatch({ type: REMOVE_TAG, tag }),
-  onSubmit: payload =>
-    dispatch({ type: ARTICLE_SUBMITTED, payload }),
+  onSubmit: () => undefined,
   onUnload: payload =>
     dispatch({ type: EDITOR_PAGE_UNLOADED }),
killedBy: Editor (connected) dispatches ARTICLE_SUBMITTED when publish button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "ARTICLE_SUBMITTED"}
Received: {"payload": null, "type": "EDITOR_PAGE_LOADED"}

Number of calls: 1

[Killed] ArrowFunction
src/components/Editor.js:27:13
     dispatch({ type: REMOVE_TAG, tag }),
   onSubmit: payload =>
     dispatch({ type: ARTICLE_SUBMITTED, payload }),
-  onUnload: payload =>
-    dispatch({ type: EDITOR_PAGE_UNLOADED }),
+  onUnload: () => undefined,
   onUpdateField: (key, value) =>
     dispatch({ type: UPDATE_FIELD_EDITOR, key, value })
killedBy: Editor (connected) dispatches EDITOR_PAGE_UNLOADED on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "type": "EDITOR_PAGE_UNLOADED",
+   "payload": null,

[Killed] ObjectLiteral
src/components/Editor.js:28:14
   onSubmit: payload =>
     dispatch({ type: ARTICLE_SUBMITTED, payload }),
   onUnload: payload =>
-    dispatch({ type: EDITOR_PAGE_UNLOADED }),
+    dispatch({}),
   onUpdateField: (key, value) =>
     dispatch({ type: UPDATE_FIELD_EDITOR, key, value })
killedBy: Editor (connected) dispatches EDITOR_PAGE_UNLOADED on unmount
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] ArrowFunction
src/components/Editor.js:29:18
     dispatch({ type: ARTICLE_SUBMITTED, payload }),
   onUnload: payload =>
     dispatch({ type: EDITOR_PAGE_UNLOADED }),
-  onUpdateField: (key, value) =>
-    dispatch({ type: UPDATE_FIELD_EDITOR, key, value })
+  onUpdateField: () => undefined
 });
 
killedBy: Editor (connected) dispatches UPDATE_FIELD_EDITOR with key and value when title input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "title", "type": "UPDATE_FIELD_EDITOR", "value": "New Title"}
Received: {"payload": null, "type": "EDITOR_PAGE_LOADED"}

Number of calls: 1

[Killed] ArrowFunction
src/components/Editor.js:38:7
     super();
 
     const updateFieldEvent =
-      key => ev => this.props.onUpdateField(key, ev.target.value);
+      () => undefined;
     this.changeTitle = updateFieldEvent('title');
     this.changeDescription = updateFieldEvent('description');
killedBy: Editor Component calls onUpdateField when title changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "title", "New Title"

Number of calls: 0

[Killed] ArrowFunction
src/components/Editor.js:38:14
     super();
 
     const updateFieldEvent =
-      key => ev => this.props.onUpdateField(key, ev.target.value);
+      key => () => undefined;
     this.changeTitle = updateFieldEvent('title');
     this.changeDescription = updateFieldEvent('description');
killedBy: Editor Component calls onUpdateField when title changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "title", "New Title"

Number of calls: 0

[Killed] BlockStatement
src/components/Editor.js:44:32
     this.changeBody = updateFieldEvent('body');
     this.changeTagInput = updateFieldEvent('tagInput');
 
-    this.watchForEnter = ev => {
-      if (ev.keyCode === 13) {
-        ev.preventDefault();
-        this.props.onAddTag();
-      }
-    };
+    this.watchForEnter = ev => {};
 
     this.removeTagHandler = tag => () => {
killedBy: Editor Component calls onAddTag when Enter (keyCode 13) is pressed in tag input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Editor.js:45:30
     this.changeTagInput = updateFieldEvent('tagInput');
 
     this.watchForEnter = ev => {
-      if (ev.keyCode === 13) {
-        ev.preventDefault();
-        this.props.onAddTag();
-      }
+      if (ev.keyCode === 13) {}
     };
 
killedBy: Editor Component calls onAddTag when Enter (keyCode 13) is pressed in tag input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/Editor.js:45:11
     this.changeTagInput = updateFieldEvent('tagInput');
 
     this.watchForEnter = ev => {
-      if (ev.keyCode === 13) {
+      if (false) {
         ev.preventDefault();
         this.props.onAddTag();
killedBy: Editor Component calls onAddTag when Enter (keyCode 13) is pressed in tag input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/components/Editor.js:51:29
       }
     };
 
-    this.removeTagHandler = tag => () => {
-      this.props.onRemoveTag(tag);
-    };
+    this.removeTagHandler = () => undefined;
 
     this.submitForm = ev => {
killedBy: Editor Component calls onRemoveTag when a tag remove icon is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "react"

Number of calls: 0

[Killed] BlockStatement
src/components/Editor.js:51:42
       }
     };
 
-    this.removeTagHandler = tag => () => {
-      this.props.onRemoveTag(tag);
-    };
+    this.removeTagHandler = tag => () => {};
 
     this.submitForm = ev => {
killedBy: Editor Component calls onRemoveTag when a tag remove icon is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "react"

Number of calls: 0

[Killed] BlockStatement
src/components/Editor.js:55:29
       this.props.onRemoveTag(tag);
     };
 
-    this.submitForm = ev => {
-      ev.preventDefault();
-      const article = {
-        title: this.props.title,
-        description: this.props.description,
-        body: this.props.body,
-        tagList: this.props.tagList
-      };
-
-      const slug = { slug: this.props.articleSlug };
-      const promise = this.props.articleSlug ?
-        agent.Articles.update(Object.assign(article, slug)) :
-        agent.Articles.create(article);
-
-      this.props.onSubmit(promise);
-    };
+    this.submitForm = ev => {};
   }
 
killedBy: Editor Component calls agent.Articles.create with exact article fields when submitting
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"body": "My Body", "description": "My Desc", "tagList": ["react"], "title": "My Title"}

Number of calls: 0

[Killed] BlockStatement
src/components/Editor.js:73:40
     };
   }
 
-  componentWillReceiveProps(nextProps) {
-    if (this.props.match.params.slug !== nextProps.match.params.slug) {
-      // Stryker disable next-line ConditionalExpression
-      if (nextProps.match.params.slug) {
-        this.props.onUnload();
-        return this.props.onLoad(agent.Articles.get(this.props.match.params.slug));
-      }
-      this.props.onLoad(null);
-    }
-  }
+  componentWillReceiveProps(nextProps) {}
 
   componentWillMount() {
killedBy: Editor Component triggers componentWillReceiveProps when match slug changes to new slug
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
src/components/Editor.js:74:9
   }
 
   componentWillReceiveProps(nextProps) {
-    if (this.props.match.params.slug !== nextProps.match.params.slug) {
+    if (true) {
       // Stryker disable next-line ConditionalExpression
       if (nextProps.match.params.slug) {
killedBy: Editor (connected) renders without crashing
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] EqualityOperator
src/components/Editor.js:74:9
   }
 
   componentWillReceiveProps(nextProps) {
-    if (this.props.match.params.slug !== nextProps.match.params.slug) {
+    if (this.props.match.params.slug === nextProps.match.params.slug) {
       // Stryker disable next-line ConditionalExpression
       if (nextProps.match.params.slug) {
killedBy: Editor Component triggers componentWillReceiveProps when match slug changes to new slug
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/components/Editor.js:76:40
   componentWillReceiveProps(nextProps) {
     if (this.props.match.params.slug !== nextProps.match.params.slug) {
       // Stryker disable next-line ConditionalExpression
-      if (nextProps.match.params.slug) {
-        this.props.onUnload();
-        return this.props.onLoad(agent.Articles.get(this.props.match.params.slug));
-      }
+      if (nextProps.match.params.slug) {}
       this.props.onLoad(null);
     }
killedBy: Editor Component componentWillReceiveProps with new slug: calls onUnload and onLoad with agent.Articles.get
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Editor.js:84:24
     }
   }
 
-  componentWillMount() {
-    if (this.props.match.params.slug) {
-      return this.props.onLoad(agent.Articles.get(this.props.match.params.slug));
-    }
-    this.props.onLoad(null);
-  }
+  componentWillMount() {}
 
   componentWillUnmount() {
killedBy: Editor Component calls onLoad(null) on mount when no slug
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null

Number of calls: 0

[Killed] ConditionalExpression
src/components/Editor.js:85:9
   }
 
   componentWillMount() {
-    if (this.props.match.params.slug) {
+    if (false) {
       return this.props.onLoad(agent.Articles.get(this.props.match.params.slug));
     }
killedBy: Editor Component calls onLoad with Articles.get on mount when slug exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "existing-article"

Number of calls: 0

[Killed] BlockStatement
src/components/Editor.js:85:39
   }
 
   componentWillMount() {
-    if (this.props.match.params.slug) {
-      return this.props.onLoad(agent.Articles.get(this.props.match.params.slug));
-    }
+    if (this.props.match.params.slug) {}
     this.props.onLoad(null);
   }
killedBy: Editor Component calls onLoad with Articles.get on mount when slug exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "existing-article"

Number of calls: 0

[Killed] BlockStatement
src/components/Editor.js:91:26
     this.props.onLoad(null);
   }
 
-  componentWillUnmount() {
-    this.props.onUnload();
-  }
+  componentWillUnmount() {}
 
   render() {
killedBy: Editor Component calls onUnload on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/components/Editor.js:146:26
 
                     <div className="tag-list">
                       {
-                        (this.props.tagList || []).map(tag => {
+                        (this.props.tagList && []).map(tag => {
                           return (
                             <span className="tag-default tag-pill" key={tag}>
killedBy: Editor Component renders with tagList=null (covers || [] branch)
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
src/components/Editor.js:146:26
 
                     <div className="tag-list">
                       {
-                        (this.props.tagList || []).map(tag => {
+                        (true).map(tag => {
                           return (
                             <span className="tag-default tag-pill" key={tag}>
killedBy: Editor Component renders editor form with inputs
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function
