[Killed] BooleanLiteral
src/components/Header.js:7:7
 
 const LoggedOutView = props => {
   // Stryker disable next-line ConditionalExpression
-  if (!props.currentUser) {
+  if (props.currentUser) {
     return (
       <ul className="nav navbar-nav pull-xs-right">
killedBy: Header renders logged-out view when no currentUser
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Sign in"
Received string:    "conduit"

[Killed] BlockStatement
src/components/Header.js:7:27
 
 const LoggedOutView = props => {
   // Stryker disable next-line ConditionalExpression
-  if (!props.currentUser) {
-    return (
-      <ul className="nav navbar-nav pull-xs-right">
-
-        <li className="nav-item">
-          <Link to="/" className="nav-link">
-            Home
-          </Link>
-        </li>
-
-        <li className="nav-item">
-          <Link to="/login" className="nav-link">
-            Sign in
-          </Link>
-        </li>
-
-        <li className="nav-item">
-          <Link to="/register" className="nav-link">
-            Sign up
-          </Link>
-        </li>
-
-      </ul>
-    );
-  }
+  if (!props.currentUser) {}
   return null;
 };
killedBy: Header renders logged-out view when no currentUser
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Sign in"
Received string:    "conduit"

[Killed] ConditionalExpression
src/components/Header.js:36:7
 };
 
 const LoggedInView = props => {
-  if (props.currentUser) {
+  if (true) {
     return (
       <ul className="nav navbar-nav pull-xs-right">
killedBy: Header renders logged-out view when no currentUser
statusReason: TypeError: Cannot read properties of null (reading 'username')

[Killed] ConditionalExpression
src/components/Header.js:36:7
 };
 
 const LoggedInView = props => {
-  if (props.currentUser) {
+  if (false) {
     return (
       <ul className="nav navbar-nav pull-xs-right">
killedBy: Header renders logged-in view when currentUser is set
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "testuser"
Received string:    "conduit"

[Killed] BlockStatement
src/components/Header.js:76:12
 };
 
 class Header extends React.Component {
-  render() {
-    return (
-      <nav className="navbar navbar-light">
-        <div className="container">
-
-          <Link to="/" className="navbar-brand">
-            {this.props.appName.toLowerCase()}
-          </Link>
-
-          <LoggedOutView currentUser={this.props.currentUser} />
-
-          <LoggedInView currentUser={this.props.currentUser} />
-        </div>
-      </nav>
-    );
-  }
+  render() {}
 }
 
killedBy: App renders loading state (appLoaded=false) — shows header only
statusReason: Error: Header(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] MethodExpression
src/components/Header.js:82:14
         <div className="container">
 
           <Link to="/" className="navbar-brand">
-            {this.props.appName.toLowerCase()}
+            {this.props.appName.toUpperCase()}
           </Link>
 
killedBy: Header renders logged-out view when no currentUser
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "conduit"
Received string:    "CONDUITHomeSign inSign up"
