[Killed] ArrowFunction
src/components/ListPagination.js:6:28
 import { connect } from 'react-redux';
 import { SET_PAGE } from '../constants/actionTypes';
 
-const mapDispatchToProps = dispatch => ({
-  // Stryker disable next-line ArrowFunction
-  onSetPage: (page, payload) =>
-    dispatch({ type: SET_PAGE, page, payload })
-});
+const mapDispatchToProps = () => undefined;
 
 const ListPagination = props => {
killedBy: ListPagination calls pager when a page link is clicked with pager prop
statusReason: TypeError: props.onSetPage is not a function

[Killed] ConditionalExpression
src/components/ListPagination.js:14:7
 
 const ListPagination = props => {
   // Stryker disable next-line EqualityOperator
-  if (props.articlesCount <= 10) {
+  if (false) {
     return null;
   }
killedBy: ListPagination renders nothing when articlesCount <= 10
statusReason: Error: expect(received).toBeNull()

Received: <nav><ul class="pagination"><li class="page-item active"><a class="page-link" href="">1</a></li></ul></nav>

[Killed] ConditionalExpression
src/components/ListPagination.js:14:7
 
 const ListPagination = props => {
   // Stryker disable next-line EqualityOperator
-  if (props.articlesCount <= 10) {
+  if (true) {
     return null;
   }
killedBy: ListPagination renders page links when articlesCount > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ArithmeticOperator
src/components/ListPagination.js:19:33
   }
 
   const range = [];
-  for (let i = 0; i < Math.ceil(props.articlesCount / 10); ++i) {
+  for (let i = 0; i < Math.ceil(props.articlesCount * 10); ++i) {
     range.push(i);
   }
killedBy: ListPagination renders page links when articlesCount > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 250

[Killed] EqualityOperator
src/components/ListPagination.js:19:19
   }
 
   const range = [];
-  for (let i = 0; i < Math.ceil(props.articlesCount / 10); ++i) {
+  for (let i = 0; i >= Math.ceil(props.articlesCount / 10); ++i) {
     range.push(i);
   }
killedBy: ListPagination renders page links when articlesCount > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/components/ListPagination.js:23:27
     range.push(i);
   }
 
-  const setPage = page => {
-    // Stryker disable next-line BlockStatement
-    if(props.pager) {
-      props.onSetPage(page, props.pager(page));
-    }else {
-      props.onSetPage(page, agent.Articles.all(page))
-    }
-  };
+  const setPage = page => {};
 
   return (
killedBy: ListPagination calls pager when a page link is clicked with pager prop
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/components/ListPagination.js:25:8
 
   const setPage = page => {
     // Stryker disable next-line BlockStatement
-    if(props.pager) {
+    if(true) {
       props.onSetPage(page, props.pager(page));
     }else {
killedBy: ListPagination calls agent.Articles.all when a page link is clicked without pager prop
statusReason: TypeError: props.pager is not a function

[Killed] ConditionalExpression
src/components/ListPagination.js:25:8
 
   const setPage = page => {
     // Stryker disable next-line BlockStatement
-    if(props.pager) {
+    if(false) {
       props.onSetPage(page, props.pager(page));
     }else {
killedBy: ListPagination calls pager when a page link is clicked with pager prop
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Survived] BlockStatement
src/components/ListPagination.js:27:11
     // Stryker disable next-line BlockStatement
     if(props.pager) {
       props.onSetPage(page, props.pager(page));
-    }else {
-      props.onSetPage(page, agent.Articles.all(page))
-    }
+    }else {}
   };
 

[Killed] BlockStatement
src/components/ListPagination.js:37:26
       <ul className="pagination">
 
         {
-          range.map(v => {
-            const isCurrent = v === props.currentPage;
-            const onClick = ev => {
-              ev.preventDefault();
-              setPage(v);
-            };
-            return (
-              <li
-                className={ isCurrent ? 'page-item active' : 'page-item' }
-                onClick={onClick}
-                key={v.toString()}>
-
-                {/* Stryker disable next-line ArithmeticOperator */}
-                <a className="page-link" href="">{v + 1}</a>
-
-              </li>
-            );
-          })
+          range.map(v => {})
         }
 
killedBy: ListPagination renders page links when articlesCount > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/components/ListPagination.js:38:31
 
         {
           range.map(v => {
-            const isCurrent = v === props.currentPage;
+            const isCurrent = false;
             const onClick = ev => {
               ev.preventDefault();
killedBy: ListPagination marks the current page as active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/components/ListPagination.js:38:31
 
         {
           range.map(v => {
-            const isCurrent = v === props.currentPage;
+            const isCurrent = v !== props.currentPage;
             const onClick = ev => {
               ev.preventDefault();
killedBy: ListPagination marks the current page as active
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/components/ListPagination.js:39:35
         {
           range.map(v => {
             const isCurrent = v === props.currentPage;
-            const onClick = ev => {
-              ev.preventDefault();
-              setPage(v);
-            };
+            const onClick = ev => {};
             return (
               <li
killedBy: ListPagination calls pager when a page link is clicked with pager prop
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] StringLiteral
src/components/ListPagination.js:45:62
             };
             return (
               <li
-                className={ isCurrent ? 'page-item active' : 'page-item' }
+                className={ isCurrent ? 'page-item active' : "" }
                 onClick={onClick}
                 key={v.toString()}>
killedBy: ListPagination renders page links when articlesCount > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Survived] ArithmeticOperator
src/components/ListPagination.js:50:51
                 key={v.toString()}>
 
                 {/* Stryker disable next-line ArithmeticOperator */}
-                <a className="page-link" href="">{v + 1}</a>
+                <a className="page-link" href="">{v - 1}</a>
 
               </li>
