[Killed] BlockStatement
src/components/Profile.js:14:38
   PROFILE_PAGE_UNLOADED
 } from '../constants/actionTypes';
 
-const EditProfileSettings = props => {
-  // Stryker disable next-line ConditionalExpression
-  if (props.isUser) {
-    return (
-      <Link
-        to="/settings"
-        className="btn btn-sm btn-outline-secondary action-btn">
-        <i className="ion-gear-a"></i> Edit Profile Settings
-      </Link>
-    );
-  }
-  return null;
-};
+const EditProfileSettings = props => {};
 
 const FollowUserButton = props => {
killedBy: Profile renders My Articles link with correct href including username
statusReason: Error: EditProfileSettings(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Profile.js:16:21
 
 const EditProfileSettings = props => {
   // Stryker disable next-line ConditionalExpression
-  if (props.isUser) {
-    return (
-      <Link
-        to="/settings"
-        className="btn btn-sm btn-outline-secondary action-btn">
-        <i className="ion-gear-a"></i> Edit Profile Settings
-      </Link>
-    );
-  }
+  if (props.isUser) {}
   return null;
 };
killedBy: Profile shows Edit Profile Settings link when isUser
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Edit Profile Settings"
Received string:    "testuserTest bioMy ArticlesFavorited ArticlesNo articles are here... yet."

[Survived] BlockStatement
src/components/Profile.js:40:10
     // Stryker disable next-line StringLiteral
     classes += ' btn-secondary';
   // Stryker disable next-line BlockStatement
-  } else {
-    // Stryker disable next-line StringLiteral
-    classes += ' btn-outline-secondary';
-  }
+  } else {}
 
   const handleClick = ev => {

[Killed] BlockStatement
src/components/Profile.js:45:29
     classes += ' btn-outline-secondary';
   }
 
-  const handleClick = ev => {
-    ev.preventDefault();
-    if (props.user.following) {
-      props.unfollow(props.user.username)
-    } else {
-      props.follow(props.user.username)
-    }
-  };
+  const handleClick = ev => {};
 
   return (
killedBy: Profile calls onFollow when Follow button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testuser"

Number of calls: 0

[Killed] ConditionalExpression
src/components/Profile.js:47:9
 
   const handleClick = ev => {
     ev.preventDefault();
-    if (props.user.following) {
+    if (false) {
       props.unfollow(props.user.username)
     } else {
killedBy: Profile calls onUnfollow when Unfollow button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testuser"

Number of calls: 0

[Killed] BlockStatement
src/components/Profile.js:47:31
 
   const handleClick = ev => {
     ev.preventDefault();
-    if (props.user.following) {
-      props.unfollow(props.user.username)
-    } else {
+    if (props.user.following) {} else {
       props.follow(props.user.username)
     }
killedBy: Profile calls onUnfollow when Unfollow button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testuser"

Number of calls: 0

[Killed] BlockStatement
src/components/Profile.js:49:12
     ev.preventDefault();
     if (props.user.following) {
       props.unfollow(props.user.username)
-    } else {
-      props.follow(props.user.username)
-    }
+    } else {}
   };
 
killedBy: Profile calls onFollow when Follow button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testuser"

Number of calls: 0

[Killed] ArrowFunction
src/components/Profile.js:65:25
   );
 };
 
-const mapStateToProps = state => ({
-  ...state.articleList,
-  currentUser: state.common.currentUser,
-  profile: state.profile
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = dispatch => ({
killedBy: Profile (connected) dispatches PROFILE_PAGE_LOADED on mount (connected)
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ArrowFunction
src/components/Profile.js:71:28
   profile: state.profile
 });
 
-const mapDispatchToProps = dispatch => ({
-  onFollow: username => dispatch({
-    type: FOLLOW_USER,
-    payload: agent.Profile.follow(username)
-  }),
-  onLoad: payload => dispatch({ type: PROFILE_PAGE_LOADED, payload }),
-  onUnfollow: username => dispatch({
-    type: UNFOLLOW_USER,
-    payload: agent.Profile.unfollow(username)
-  }),
-  onUnload: () => dispatch({ type: PROFILE_PAGE_UNLOADED })
-});
+const mapDispatchToProps = () => undefined;
 
 class Profile extends React.Component {
killedBy: Profile (connected) dispatches PROFILE_PAGE_LOADED on mount (connected)
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ArrowFunction
src/components/Profile.js:72:13
 });
 
 const mapDispatchToProps = dispatch => ({
-  onFollow: username => dispatch({
-    type: FOLLOW_USER,
-    payload: agent.Profile.follow(username)
-  }),
+  onFollow: () => undefined,
   onLoad: payload => dispatch({ type: PROFILE_PAGE_LOADED, payload }),
   onUnfollow: username => dispatch({
killedBy: Profile (connected) dispatches FOLLOW_USER when Follow is clicked (connected)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "FOLLOW_USER"}
Received: {"payload": {}, "type": "PROFILE_PAGE_LOADED"}

Number of calls: 1

[Killed] ObjectLiteral
src/components/Profile.js:72:34
 });
 
 const mapDispatchToProps = dispatch => ({
-  onFollow: username => dispatch({
-    type: FOLLOW_USER,
-    payload: agent.Profile.follow(username)
-  }),
+  onFollow: username => dispatch({}),
   onLoad: payload => dispatch({ type: PROFILE_PAGE_LOADED, payload }),
   onUnfollow: username => dispatch({
killedBy: Profile (connected) dispatches FOLLOW_USER when Follow is clicked (connected)
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] ArrowFunction
src/components/Profile.js:76:11
     type: FOLLOW_USER,
     payload: agent.Profile.follow(username)
   }),
-  onLoad: payload => dispatch({ type: PROFILE_PAGE_LOADED, payload }),
+  onLoad: () => undefined,
   onUnfollow: username => dispatch({
     type: UNFOLLOW_USER,
killedBy: Profile (connected) dispatches PROFILE_PAGE_LOADED on mount (connected)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "PROFILE_PAGE_LOADED"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Profile.js:77:15
     payload: agent.Profile.follow(username)
   }),
   onLoad: payload => dispatch({ type: PROFILE_PAGE_LOADED, payload }),
-  onUnfollow: username => dispatch({
-    type: UNFOLLOW_USER,
-    payload: agent.Profile.unfollow(username)
-  }),
+  onUnfollow: () => undefined,
   onUnload: () => dispatch({ type: PROFILE_PAGE_UNLOADED })
 });
killedBy: Profile (connected) dispatches UNFOLLOW_USER when Unfollow is clicked (connected)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "UNFOLLOW_USER"}
Received: {"payload": {}, "type": "PROFILE_PAGE_LOADED"}

Number of calls: 1

[Killed] ArrowFunction
src/components/Profile.js:81:13
     type: UNFOLLOW_USER,
     payload: agent.Profile.unfollow(username)
   }),
-  onUnload: () => dispatch({ type: PROFILE_PAGE_UNLOADED })
+  onUnload: () => undefined
 });
 
killedBy: Profile (connected) dispatches PROFILE_PAGE_UNLOADED on unmount (connected)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "type": "PROFILE_PAGE_UNLOADED",
+   "payload": Promise {},

[Killed] BlockStatement
src/components/Profile.js:85:24
 });
 
 class Profile extends React.Component {
-  componentWillMount() {
-    // Stryker disable next-line ArrayDeclaration
-    this.props.onLoad(Promise.all([
-      agent.Profile.get(this.props.match.params.username),
-      agent.Articles.byAuthor(this.props.match.params.username)
-    ]));
-  }
+  componentWillMount() {}
 
   componentWillUnmount() {
killedBy: Profile calls onLoad on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/Profile.js:97:16
     this.props.onUnload();
   }
 
-  renderTabs() {
-    return (
-      <ul className="nav nav-pills outline-active">
-        <li className="nav-item">
-          <Link
-            className="nav-link active"
-            to={`/@${this.props.profile.username}`}>
-            My Articles
-          </Link>
-        </li>
-
-        <li className="nav-item">
-          <Link
-            className="nav-link"
-            to={`/@${this.props.profile.username}/favorites`}>
-            Favorited Articles
-          </Link>
-        </li>
-      </ul>
-    );
-  }
+  renderTabs() {}
 
   render() {
killedBy: Profile renders My Articles link with correct href including username
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BooleanLiteral
src/components/Profile.js:121:9
 
   render() {
     const profile = this.props.profile;
-    if (!profile) {
+    if (profile) {
       return null;
     }
killedBy: Profile renders My Articles link with correct href including username
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/components/Profile.js:121:9
 
   render() {
     const profile = this.props.profile;
-    if (!profile) {
+    if (true) {
       return null;
     }
killedBy: Profile renders My Articles link with correct href including username
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/components/Profile.js:125:20
       return null;
     }
 
-    const isUser = this.props.currentUser &&
-      this.props.profile.username === this.props.currentUser.username;
+    const isUser = true;
 
     return (
killedBy: Profile shows Follow button when not isUser and not following
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Follow"
Received string:    "testuserTest bio Edit Profile SettingsMy ArticlesFavorited ArticlesNo articles are here... yet."

[Killed] ConditionalExpression
src/components/Profile.js:125:20
       return null;
     }
 
-    const isUser = this.props.currentUser &&
-      this.props.profile.username === this.props.currentUser.username;
+    const isUser = false;
 
     return (
killedBy: Profile shows Edit Profile Settings link when isUser
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Edit Profile Settings"
Received string:    "testuserTest bio Follow testuserMy ArticlesFavorited ArticlesNo articles are here... yet."

[Killed] EqualityOperator
src/components/Profile.js:126:7
     }
 
     const isUser = this.props.currentUser &&
-      this.props.profile.username === this.props.currentUser.username;
+      this.props.profile.username !== this.props.currentUser.username;
 
     return (
killedBy: Profile shows Edit Profile Settings link when isUser
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Edit Profile Settings"
Received string:    "testuserTest bio Follow testuserMy ArticlesFavorited ArticlesNo articles are here... yet."

[Killed] ConditionalExpression
src/components/Profile.js:126:7
     }
 
     const isUser = this.props.currentUser &&
-      this.props.profile.username === this.props.currentUser.username;
+      true;
 
     return (
killedBy: Profile shows Follow button when not isUser and not following
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Follow"
Received string:    "testuserTest bio Edit Profile SettingsMy ArticlesFavorited ArticlesNo articles are here... yet."
