[Killed] ArrowFunction
src/components/ProfileFavorites.js:11:28
   PROFILE_PAGE_UNLOADED
 } from '../constants/actionTypes';
 
-const mapDispatchToProps = dispatch => ({
-  onLoad: (pager, payload) =>
-    dispatch({ type: PROFILE_PAGE_LOADED, pager, payload }),
-  onUnload: () =>
-    dispatch({ type: PROFILE_PAGE_UNLOADED })
-});
+const mapDispatchToProps = () => undefined;
 
 class ProfileFavorites extends Profile {
killedBy: ProfileFavorites renders profile page
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ObjectLiteral
src/components/ProfileFavorites.js:11:41
   PROFILE_PAGE_UNLOADED
 } from '../constants/actionTypes';
 
-const mapDispatchToProps = dispatch => ({
-  onLoad: (pager, payload) =>
-    dispatch({ type: PROFILE_PAGE_LOADED, pager, payload }),
-  onUnload: () =>
-    dispatch({ type: PROFILE_PAGE_UNLOADED })
-});
+const mapDispatchToProps = dispatch => ({});
 
 class ProfileFavorites extends Profile {
killedBy: ProfileFavorites renders profile page
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ArrowFunction
src/components/ProfileFavorites.js:12:11
 } from '../constants/actionTypes';
 
 const mapDispatchToProps = dispatch => ({
-  onLoad: (pager, payload) =>
-    dispatch({ type: PROFILE_PAGE_LOADED, pager, payload }),
+  onLoad: () => undefined,
   onUnload: () =>
     dispatch({ type: PROFILE_PAGE_UNLOADED })
killedBy: ProfileFavorites dispatches PROFILE_PAGE_LOADED on mount with pager and calls agent methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "PROFILE_PAGE_LOADED"}

Number of calls: 0

[Killed] ArrowFunction
src/components/ProfileFavorites.js:14:13
 const mapDispatchToProps = dispatch => ({
   onLoad: (pager, payload) =>
     dispatch({ type: PROFILE_PAGE_LOADED, pager, payload }),
-  onUnload: () =>
-    dispatch({ type: PROFILE_PAGE_UNLOADED })
+  onUnload: () => undefined
 });
 
killedBy: ProfileFavorites dispatches PROFILE_PAGE_UNLOADED on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "type": "PROFILE_PAGE_UNLOADED",
+   "pager": [Function anonymous],

[Killed] BlockStatement
src/components/ProfileFavorites.js:19:24
 });
 
 class ProfileFavorites extends Profile {
-  componentWillMount() {
-    // Stryker disable next-line ArrowFunction
-    this.props.onLoad(page => agent.Articles.favoritedBy(this.props.match.params.username, page), Promise.all([
-      agent.Profile.get(this.props.match.params.username),
-      agent.Articles.favoritedBy(this.props.match.params.username)
-    ]));
-  }
+  componentWillMount() {}
 
   componentWillUnmount() {
killedBy: ProfileFavorites dispatches PROFILE_PAGE_LOADED on mount with pager and calls agent methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "PROFILE_PAGE_LOADED"}

Number of calls: 0

[Killed] ArrayDeclaration
src/components/ProfileFavorites.js:21:111
 class ProfileFavorites extends Profile {
   componentWillMount() {
     // Stryker disable next-line ArrowFunction
-    this.props.onLoad(page => agent.Articles.favoritedBy(this.props.match.params.username, page), Promise.all([
-      agent.Profile.get(this.props.match.params.username),
-      agent.Articles.favoritedBy(this.props.match.params.username)
-    ]));
+    this.props.onLoad(page => agent.Articles.favoritedBy(this.props.match.params.username, page), Promise.all([]));
   }
 
killedBy: ProfileFavorites dispatches PROFILE_PAGE_LOADED on mount with pager and calls agent methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "testuser"

Number of calls: 0

[Killed] BlockStatement
src/components/ProfileFavorites.js:31:16
     this.props.onUnload();
   }
 
-  renderTabs() {
-    return (
-      <ul className="nav nav-pills outline-active">
-        <li className="nav-item">
-          <Link
-            className="nav-link"
-            to={`/@${this.props.profile.username}`}>
-            My Articles
-          </Link>
-        </li>
-
-        <li className="nav-item">
-          <Link
-            className="nav-link active"
-            to={`/@${this.props.profile.username}/favorites`}>
-            Favorited Articles
-          </Link>
-        </li>
-      </ul>
-    );
-  }
+  renderTabs() {}
 }
 
killedBy: ProfileFavorites renders Favorited Articles tab
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Favorited Articles"
Received string:    "testuserbio Follow testuserNo articles are here... yet."

[Killed] StringLiteral
src/components/ProfileFavorites.js:37:17
         <li className="nav-item">
           <Link
             className="nav-link"
-            to={`/@${this.props.profile.username}`}>
+            to={``}>
             My Articles
           </Link>
killedBy: ProfileFavorites My Articles link has correct href with username
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/@testuser"
Received: "/"
