[Killed] ArrowFunction
src/components/UserImage.js:3:18
 import React from 'react';
 
-const FALLBACK = username =>
-  `https://ui-avatars.com/api/?name=${encodeURIComponent(username || 'User')}&background=5cb85c&color=fff&size=128`;
+const FALLBACK = () => undefined;
 
 // Stryker disable next-line BlockStatement
killedBy: UserImage uses fallback URL when src is empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "ui-avatars.com"
Received string:    ""

[Killed] ConditionalExpression
src/components/UserImage.js:4:58
 import React from 'react';
 
 const FALLBACK = username =>
-  `https://ui-avatars.com/api/?name=${encodeURIComponent(username || 'User')}&background=5cb85c&color=fff&size=128`;
+  `https://ui-avatars.com/api/?name=${encodeURIComponent(true)}&background=5cb85c&color=fff&size=128`;
 
 // Stryker disable next-line BlockStatement
killedBy: UserImage uses fallback URL when src is empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "alice"
Received string:    "https://ui-avatars.com/api/?name=true&background=5cb85c&color=fff&size=128"

[Killed] ConditionalExpression
src/components/UserImage.js:4:58
 import React from 'react';
 
 const FALLBACK = username =>
-  `https://ui-avatars.com/api/?name=${encodeURIComponent(username || 'User')}&background=5cb85c&color=fff&size=128`;
+  `https://ui-avatars.com/api/?name=${encodeURIComponent(false)}&background=5cb85c&color=fff&size=128`;
 
 // Stryker disable next-line BlockStatement
killedBy: UserImage uses fallback URL when src is empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "alice"
Received string:    "https://ui-avatars.com/api/?name=false&background=5cb85c&color=fff&size=128"

[Killed] ArrowFunction
src/components/UserImage.js:12:19
   e.target.src = FALLBACK(username);
 };
 
-const UserImage = ({ src, username, className, alt }) => (
-  <img
-    src={src || FALLBACK(username)}
-    className={className}
-    alt={alt || username}
-    // Stryker disable next-line ArrowFunction
-    onError={e => handleError(e, username)}
-  />
-);
+const UserImage = () => undefined;
 
 export default UserImage;
killedBy: ProfileFavorites renders profile page
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
src/components/UserImage.js:14:10
 
 const UserImage = ({ src, username, className, alt }) => (
   <img
-    src={src || FALLBACK(username)}
+    src={false}
     className={className}
     alt={alt || username}
killedBy: UserImage renders with provided src
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://example.com/pic.jpg"
Received: ""

[Killed] ConditionalExpression
src/components/UserImage.js:14:10
 
 const UserImage = ({ src, username, className, alt }) => (
   <img
-    src={src || FALLBACK(username)}
+    src={true}
     className={className}
     alt={alt || username}
killedBy: UserImage renders with provided src
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://example.com/pic.jpg"
Received: ""

[Killed] LogicalOperator
src/components/UserImage.js:16:10
   <img
     src={src || FALLBACK(username)}
     className={className}
-    alt={alt || username}
+    alt={alt && username}
     // Stryker disable next-line ArrowFunction
     onError={e => handleError(e, username)}
killedBy: UserImage renders alt from alt prop if provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "custom alt"
Received: "alice"

[Killed] ConditionalExpression
src/components/UserImage.js:16:10
   <img
     src={src || FALLBACK(username)}
     className={className}
-    alt={alt || username}
+    alt={false}
     // Stryker disable next-line ArrowFunction
     onError={e => handleError(e, username)}
killedBy: UserImage renders alt from alt prop if provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "custom alt"
Received: ""
