[Killed] ConditionalExpression
src/reducers/editor.js:13:5
 
 export default (state = {}, action) => {
   switch (action.type) {
-    case EDITOR_PAGE_LOADED:
-      return {
-        ...state,
-        articleSlug: action.payload ? action.payload.article.slug : '',
-        title: action.payload ? action.payload.article.title : '',
-        description: action.payload ? action.payload.article.description : '',
-        body: action.payload ? action.payload.article.body : '',
-        tagInput: '',
-        tagList: action.payload ? action.payload.article.tagList : []
-      };
+    case EDITOR_PAGE_LOADED:
     case EDITOR_PAGE_UNLOADED:
       return {};
killedBy: editor reducer handles EDITOR_PAGE_LOADED with payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "my-slug"
Received: undefined

[Killed] StringLiteral
src/reducers/editor.js:19:62
         articleSlug: action.payload ? action.payload.article.slug : '',
         title: action.payload ? action.payload.article.title : '',
         description: action.payload ? action.payload.article.description : '',
-        body: action.payload ? action.payload.article.body : '',
+        body: action.payload ? action.payload.article.body : "Stryker was here!",
         tagInput: '',
         tagList: action.payload ? action.payload.article.tagList : []
killedBy: editor reducer handles EDITOR_PAGE_LOADED without payload (new article)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] StringLiteral
src/reducers/editor.js:20:19
         title: action.payload ? action.payload.article.title : '',
         description: action.payload ? action.payload.article.description : '',
         body: action.payload ? action.payload.article.body : '',
-        tagInput: '',
+        tagInput: "Stryker was here!",
         tagList: action.payload ? action.payload.article.tagList : []
       };
killedBy: editor reducer handles EDITOR_PAGE_LOADED with payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] ConditionalExpression
src/reducers/editor.js:23:5
         tagInput: '',
         tagList: action.payload ? action.payload.article.tagList : []
       };
-    case EDITOR_PAGE_UNLOADED:
-      return {};
+    case EDITOR_PAGE_UNLOADED:
     case ARTICLE_SUBMITTED:
       return {
killedBy: editor reducer handles EDITOR_PAGE_UNLOADED
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

- Object {}
+ Object {
+   "errors": null,

[Killed] ConditionalExpression
src/reducers/editor.js:25:5
       };
     case EDITOR_PAGE_UNLOADED:
       return {};
-    case ARTICLE_SUBMITTED:
-      return {
-        ...state,
-        inProgress: null,
-        errors: action.error ? action.payload.errors : null
-      };
+    case ARTICLE_SUBMITTED:
     case ASYNC_START:
       if (action.subtype === ARTICLE_SUBMITTED) {
killedBy: editor reducer handles ARTICLE_SUBMITTED success
statusReason: Error: expect(received).toBeNull()

Received: true

[Killed] ConditionalExpression
src/reducers/editor.js:31:5
         inProgress: null,
         errors: action.error ? action.payload.errors : null
       };
-    case ASYNC_START:
-      if (action.subtype === ARTICLE_SUBMITTED) {
-        return { ...state, inProgress: true };
-      }
-      break;
+    case ASYNC_START:
     case ADD_TAG:
       return {
killedBy: editor reducer handles ASYNC_START with ARTICLE_SUBMITTED subtype
statusReason: TypeError: Cannot read properties of undefined (reading 'concat')

[Killed] EqualityOperator
src/reducers/editor.js:32:11
         errors: action.error ? action.payload.errors : null
       };
     case ASYNC_START:
-      if (action.subtype === ARTICLE_SUBMITTED) {
+      if (action.subtype !== ARTICLE_SUBMITTED) {
         return { ...state, inProgress: true };
       }
killedBy: editor reducer handles ASYNC_START with ARTICLE_SUBMITTED subtype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/reducers/editor.js:32:11
         errors: action.error ? action.payload.errors : null
       };
     case ASYNC_START:
-      if (action.subtype === ARTICLE_SUBMITTED) {
+      if (true) {
         return { ...state, inProgress: true };
       }
killedBy: editor reducer handles ASYNC_START with other subtype — unchanged
statusReason: Error: expect(received).toBeUndefined()

Received: true

[Killed] BooleanLiteral
src/reducers/editor.js:33:40
       };
     case ASYNC_START:
       if (action.subtype === ARTICLE_SUBMITTED) {
-        return { ...state, inProgress: true };
+        return { ...state, inProgress: false };
       }
       break;
killedBy: editor reducer handles ASYNC_START with ARTICLE_SUBMITTED subtype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/reducers/editor.js:33:16
       };
     case ASYNC_START:
       if (action.subtype === ARTICLE_SUBMITTED) {
-        return { ...state, inProgress: true };
+        return {};
       }
       break;
killedBy: editor reducer handles ASYNC_START with ARTICLE_SUBMITTED subtype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/reducers/editor.js:36:5
         return { ...state, inProgress: true };
       }
       break;
-    case ADD_TAG:
-      return {
-        ...state,
-        tagList: state.tagList.concat([state.tagInput]),
-        tagInput: ''
-      };
+    case ADD_TAG:
     case REMOVE_TAG:
       return {
killedBy: editor reducer handles ADD_TAG
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Array [
    "existing",
-   "newtag",

[Killed] ArrayDeclaration
src/reducers/editor.js:39:39
     case ADD_TAG:
       return {
         ...state,
-        tagList: state.tagList.concat([state.tagInput]),
+        tagList: state.tagList.concat([]),
         tagInput: ''
       };
killedBy: editor reducer handles ADD_TAG
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Array [
    "existing",
-   "newtag",

[Killed] ConditionalExpression
src/reducers/editor.js:42:5
         tagList: state.tagList.concat([state.tagInput]),
         tagInput: ''
       };
-    case REMOVE_TAG:
-      return {
-        ...state,
-        tagList: state.tagList.filter(tag => tag !== action.tag)
-      };
+    case REMOVE_TAG:
     case UPDATE_FIELD_EDITOR:
       return { ...state, [action.key]: action.value };
killedBy: editor reducer handles REMOVE_TAG
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Array [
    "keep",
+   "remove",

[Killed] ConditionalExpression
src/reducers/editor.js:45:46
     case REMOVE_TAG:
       return {
         ...state,
-        tagList: state.tagList.filter(tag => tag !== action.tag)
+        tagList: state.tagList.filter(tag => false)
       };
     case UPDATE_FIELD_EDITOR:
killedBy: editor reducer handles REMOVE_TAG
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

- Array [
-   "keep",
-   "also-keep",

[Killed] MethodExpression
src/reducers/editor.js:45:18
     case REMOVE_TAG:
       return {
         ...state,
-        tagList: state.tagList.filter(tag => tag !== action.tag)
+        tagList: state.tagList
       };
     case UPDATE_FIELD_EDITOR:
killedBy: editor reducer handles REMOVE_TAG
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Array [
    "keep",
+   "remove",

[Killed] ConditionalExpression
src/reducers/editor.js:47:5
         ...state,
         tagList: state.tagList.filter(tag => tag !== action.tag)
       };
-    case UPDATE_FIELD_EDITOR:
-      return { ...state, [action.key]: action.value };
+    case UPDATE_FIELD_EDITOR:
+// Stryker disable next-line ConditionalExpression
     // Stryker disable next-line ConditionalExpression
     default:
killedBy: editor reducer handles UPDATE_FIELD_EDITOR
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Title"
Received: undefined
