[Killed] BlockStatement
src/components/Article/ArticleMeta.js:6:30
 import React from 'react';
 import UserImage from '../UserImage';
 
-const ArticleMeta = props => {
-  const article = props.article;
-  return (
-    <div className="article-meta">
-      {/* Stryker disable next-line StringLiteral */}
-      <Link to={`/@${article.author.username}`}>
-        <UserImage src={article.author.image} username={article.author.username} />
-      </Link>
-
-      <div className="info">
-        {/* Stryker disable next-line StringLiteral */}
-        <Link to={`/@${article.author.username}`} className="author">
-          {article.author.username}
-        </Link>
-        <span className="date">
-          {new Date(article.createdAt).toDateString()}
-        </span>
-      </div>
-
-      <ArticleActions canModify={props.canModify} article={article} />
-    </div>
-  );
-};
+const ArticleMeta = props => {};
 
 export default ArticleMeta;
killedBy: Article renders article page when article exists
statusReason: Error: ArticleMeta(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
src/components/Article/ArticleMeta.js:11:17
   return (
     <div className="article-meta">
       {/* Stryker disable next-line StringLiteral */}
-      <Link to={`/@${article.author.username}`}>
+      <Link to={``}>
         <UserImage src={article.author.image} username={article.author.username} />
       </Link>
