[Killed] ConditionalExpression
src/components/Article/Comment.js:8:16
 
 const Comment = props => {
   const comment = props.comment;
-  const show = props.currentUser &&
-    props.currentUser.username === comment.author.username;
+  const show = false;
   return (
     <div className="card">
killedBy: Comment shows delete button when currentUser is the author
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/components/Article/Comment.js:8:16
 
 const Comment = props => {
   const comment = props.comment;
-  const show = props.currentUser &&
-    props.currentUser.username === comment.author.username;
+  const show = true;
   return (
     <div className="card">
killedBy: Comment hides delete button when currentUser is not the author
statusReason: Error: expect(received).toBeNull()

Received: <span class="mod-options"><i class="ion-trash-a" /></span>

[Killed] ConditionalExpression
src/components/Article/Comment.js:9:5
 const Comment = props => {
   const comment = props.comment;
   const show = props.currentUser &&
-    props.currentUser.username === comment.author.username;
+    true;
   return (
     <div className="card">
killedBy: Comment hides delete button when currentUser is not the author
statusReason: Error: expect(received).toBeNull()

Received: <span class="mod-options"><i class="ion-trash-a" /></span>

[Killed] EqualityOperator
src/components/Article/Comment.js:9:5
 const Comment = props => {
   const comment = props.comment;
   const show = props.currentUser &&
-    props.currentUser.username === comment.author.username;
+    props.currentUser.username !== comment.author.username;
   return (
     <div className="card">
killedBy: Comment shows delete button when currentUser is the author
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Survived] StringLiteral
src/components/Article/Comment.js:17:19
       </div>
       <div className="card-footer">
         {/* Stryker disable next-line StringLiteral */}
-        <Link to={`/@${comment.author.username}`}
+        <Link to={``}
           className="comment-author">
           <UserImage src={comment.author.image} username={comment.author.username} className="comment-author-img" />
