[Killed] ConditionalExpression
src/components/Article/CommentContainer.js:7:7
 import React from 'react';
 
 const CommentContainer = props => {
-  if (props.currentUser) {
+  if (true) {
     return (
       <div className="col-xs-12 col-md-8 offset-md-2">
killedBy: Article renders article page when article exists
statusReason: TypeError: Cannot read properties of null (reading 'image')

[Killed] BlockStatement
src/components/Article/CommentContainer.js:7:26
 import React from 'react';
 
 const CommentContainer = props => {
-  if (props.currentUser) {
-    return (
-      <div className="col-xs-12 col-md-8 offset-md-2">
-        <div>
-          <list-errors errors={props.errors}></list-errors>
-          <CommentInput slug={props.slug} currentUser={props.currentUser} />
-        </div>
-
-        <CommentList
-          comments={props.comments}
-          slug={props.slug}
-          currentUser={props.currentUser} />
-      </div>
-    );
-  } else {
+  if (props.currentUser) {} else {
     return (
       <div className="col-xs-12 col-md-8 offset-md-2">
killedBy: Article canModify=true when currentUser matches author
statusReason: Error: CommentContainer(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Article/CommentContainer.js:21:10
           currentUser={props.currentUser} />
       </div>
     );
-  } else {
-    return (
-      <div className="col-xs-12 col-md-8 offset-md-2">
-        <p>
-          <Link to="/login">Sign in</Link>
-          &nbsp;or&nbsp;
-          <Link to="/register">sign up</Link>
-          &nbsp;to add comments on this article.
-        </p>
-
-        <CommentList
-          comments={props.comments}
-          slug={props.slug}
-          currentUser={props.currentUser} />
-      </div>
-    );
-  }
+  } else {}
 };
 
killedBy: Article renders article page when article exists
statusReason: Error: CommentContainer(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
