[Killed] BlockStatement
src/components/Article/CommentList.js:4:30
 import Comment from './Comment';
 import React from 'react';
 
-const CommentList = props => {
-  return (
-    <div>
-      {
-        props.comments.map(comment => {
-          return (
-            <Comment
-              comment={comment}
-              currentUser={props.currentUser}
-              slug={props.slug}
-              key={comment.id} />
-          );
-        })
-      }
-    </div>
-  );
-};
+const CommentList = props => {};
 
 export default CommentList;
killedBy: Article renders article page when article exists
statusReason: Error: CommentList(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Article/CommentList.js:8:39
   return (
     <div>
       {
-        props.comments.map(comment => {
-          return (
-            <Comment
-              comment={comment}
-              currentUser={props.currentUser}
-              slug={props.slug}
-              key={comment.id} />
-          );
-        })
+        props.comments.map(comment => {})
       }
     </div>
killedBy: CommentList renders a list of comments
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "First"
Received string:    ""
