[Killed] ArrowFunction
src/components/Article/index.js:9:25
 import marked from 'marked';
 import { ARTICLE_PAGE_LOADED, ARTICLE_PAGE_UNLOADED } from '../../constants/actionTypes';
 
-const mapStateToProps = state => ({
-  ...state.article,
-  currentUser: state.common.currentUser
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = dispatch => ({
killedBy: Article renders article page when article exists
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ArrowFunction
src/components/Article/index.js:14:28
   currentUser: state.common.currentUser
 });
 
-const mapDispatchToProps = dispatch => ({
-  onLoad: payload =>
-    dispatch({ type: ARTICLE_PAGE_LOADED, payload }),
-  onUnload: () =>
-    dispatch({ type: ARTICLE_PAGE_UNLOADED })
-});
+const mapDispatchToProps = () => undefined;
 
 class Article extends React.Component {
killedBy: Article renders null when no article in state
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ArrowFunction
src/components/Article/index.js:15:11
 });
 
 const mapDispatchToProps = dispatch => ({
-  onLoad: payload =>
-    dispatch({ type: ARTICLE_PAGE_LOADED, payload }),
+  onLoad: () => undefined,
   onUnload: () =>
     dispatch({ type: ARTICLE_PAGE_UNLOADED })
killedBy: Article dispatches ARTICLE_PAGE_LOADED with Promise.all on mount and calls agent methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "ARTICLE_PAGE_LOADED"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Article/index.js:17:13
 const mapDispatchToProps = dispatch => ({
   onLoad: payload =>
     dispatch({ type: ARTICLE_PAGE_LOADED, payload }),
-  onUnload: () =>
-    dispatch({ type: ARTICLE_PAGE_UNLOADED })
+  onUnload: () => undefined
 });
 
killedBy: Article dispatches ARTICLE_PAGE_UNLOADED on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "type": "ARTICLE_PAGE_UNLOADED",
+   "payload": Promise {},

[Killed] BlockStatement
src/components/Article/index.js:22:24
 });
 
 class Article extends React.Component {
-  componentWillMount() {
-    this.props.onLoad(Promise.all([
-      agent.Articles.get(this.props.match.params.id),
-      agent.Comments.forArticle(this.props.match.params.id)
-    ]));
-  }
+  componentWillMount() {}
 
   componentWillUnmount() {
killedBy: Article dispatches ARTICLE_PAGE_LOADED with Promise.all on mount and calls agent methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "ARTICLE_PAGE_LOADED"}

Number of calls: 0

[Killed] ConditionalExpression
src/components/Article/index.js:34:9
   }
 
   render() {
-    if (!this.props.article) {
+    if (true) {
       return null;
     }
killedBy: Article renders article page when article exists
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/components/Article/index.js:34:9
   }
 
   render() {
-    if (!this.props.article) {
+    if (false) {
       return null;
     }
killedBy: Article renders null when no article in state
statusReason: TypeError: Cannot read properties of null (reading 'body')

[Killed] BooleanLiteral
src/components/Article/index.js:38:74
       return null;
     }
 
-    const markup = { __html: marked(this.props.article.body, { sanitize: true }) };
+    const markup = { __html: marked(this.props.article.body, { sanitize: false }) };
     const canModify = this.props.currentUser &&
       this.props.currentUser.username === this.props.article.author.username;
killedBy: Article sanitizes HTML in article body (sanitize:true must strip script tags)
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "<script>"

[Killed] LogicalOperator
src/components/Article/index.js:39:23
     }
 
     const markup = { __html: marked(this.props.article.body, { sanitize: true }) };
-    const canModify = this.props.currentUser &&
-      this.props.currentUser.username === this.props.article.author.username;
+    const canModify = this.props.currentUser || this.props.currentUser.username === this.props.article.author.username;
     return (
       <div className="article-page">
killedBy: Article renders article page when article exists
statusReason: TypeError: Cannot read properties of null (reading 'username')

[Killed] ConditionalExpression
src/components/Article/index.js:39:23
     }
 
     const markup = { __html: marked(this.props.article.body, { sanitize: true }) };
-    const canModify = this.props.currentUser &&
-      this.props.currentUser.username === this.props.article.author.username;
+    const canModify = true;
     return (
       <div className="article-page">
killedBy: Article canModify=false when currentUser does NOT match author
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Edit Article"
Received string:        "Test Articleauthor1Sun Dec 31 2023 Edit Article Delete ArticleHello world
reactPost Comment"

[Killed] ConditionalExpression
src/components/Article/index.js:40:7
 
     const markup = { __html: marked(this.props.article.body, { sanitize: true }) };
     const canModify = this.props.currentUser &&
-      this.props.currentUser.username === this.props.article.author.username;
+      true;
     return (
       <div className="article-page">
killedBy: Article canModify=false when currentUser does NOT match author
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Edit Article"
Received string:        "Test Articleauthor1Sun Dec 31 2023 Edit Article Delete ArticleHello world
reactPost Comment"

[Killed] EqualityOperator
src/components/Article/index.js:40:7
 
     const markup = { __html: marked(this.props.article.body, { sanitize: true }) };
     const canModify = this.props.currentUser &&
-      this.props.currentUser.username === this.props.article.author.username;
+      this.props.currentUser.username !== this.props.article.author.username;
     return (
       <div className="article-page">
killedBy: Article canModify=true when currentUser matches author
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Edit Article"
Received string:    "Test Articleauthor1Sun Dec 31 2023Hello world
reactPost Comment"

[Killed] BlockStatement
src/components/Article/index.js:64:57
 
               <ul className="tag-list">
                 {
-                  this.props.article.tagList.map(tag => {
-                    return (
-                      <li
-                        className="tag-default tag-pill tag-outline"
-                        key={tag}>
-                        {tag}
-                      </li>
-                    );
-                  })
+                  this.props.article.tagList.map(tag => {})
                 }
               </ul>
killedBy: Article renders article tags in tag list
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "react"
Received string:    "Test Articleauthor1Sun Dec 31 2023Hello world
Sign in or sign up to add comments on this article."

[Killed] LogicalOperator
src/components/Article/index.js:86:25
 
           <div className="row">
             <CommentContainer
-              comments={this.props.comments || []}
+              comments={this.props.comments && []}
               errors={this.props.commentErrors}
               slug={this.props.match.params.id}
killedBy: Article renders with comments=undefined (falls back to [])
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/components/Article/index.js:86:25
 
           <div className="row">
             <CommentContainer
-              comments={this.props.comments || []}
+              comments={false}
               errors={this.props.commentErrors}
               slug={this.props.match.params.id}
killedBy: Article renders article page when article exists
statusReason: TypeError: props.comments.map is not a function
