[Killed] BooleanLiteral
src/components/ArticleList.js:6:7
 import React from 'react';
 
 const ArticleList = props => {
-  if (!props.articles) {
+  if (props.articles) {
     return (
       <div className="article-preview">Loading...</div>
killedBy: ArticleList renders loading state when articles is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/components/ArticleList.js:6:24
 import React from 'react';
 
 const ArticleList = props => {
-  if (!props.articles) {
-    return (
-      <div className="article-preview">Loading...</div>
-    );
-  }
+  if (!props.articles) {}
 
   if (props.articles.length === 0) {
killedBy: ArticleList renders loading state when articles is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/components/ArticleList.js:12:7
     );
   }
 
-  if (props.articles.length === 0) {
+  if (props.articles.length !== 0) {
     return (
       <div className="article-preview">
killedBy: ArticleList renders empty message when articles is empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No articles are here"
Received string:    ""

[Killed] BlockStatement
src/components/ArticleList.js:12:36
     );
   }
 
-  if (props.articles.length === 0) {
-    return (
-      <div className="article-preview">
-        No articles are here... yet.
-      </div>
-    );
-  }
+  if (props.articles.length === 0) {}
 
   return (
killedBy: ArticleList renders empty message when articles is empty
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "No articles are here"
Received string:    ""

[Killed] BlockStatement
src/components/ArticleList.js:23:39
   return (
     <div>
       {
-        props.articles.map(article => {
-          return (
-            <ArticlePreview article={article} key={article.slug} />
-          );
-        })
+        props.articles.map(article => {})
       }
 
killedBy: ArticleList renders articles when provided
statusReason: Error: expect(received).toBeTruthy()

Received: null
