[Killed] BlockStatement
src/components/Home/Banner.js:3:40
 import React from 'react';
 
-const Banner = ({ appName, token }) => {
-  if (token) {
-    return null;
-  }
-  return (
-    <div className="banner">
-      <div className="container">
-        <h1 className="logo-font">
-          {appName.toLowerCase()}
-        </h1>
-        <p>A place to share your knowledge.</p>
-      </div>
-    </div>
-  );
-};
+const Banner = ({ appName, token }) => {};
 
 export default Banner;
killedBy: App renders full app with routes when appLoaded=true
statusReason: Error: Banner(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Home/Banner.js:4:14
 import React from 'react';
 
 const Banner = ({ appName, token }) => {
-  if (token) {
-    return null;
-  }
+  if (token) {}
   return (
     <div className="banner">
killedBy: Banner renders nothing when token is present
statusReason: Error: expect(received).toBeNull()

Received: <div class="banner"><div class="container"><h1 class="logo-font">conduit</h1><p>A place to share your knowledge.</p></div></div>

[Killed] ConditionalExpression
src/components/Home/Banner.js:4:7
 import React from 'react';
 
 const Banner = ({ appName, token }) => {
-  if (token) {
+  if (true) {
     return null;
   }
killedBy: Home renders banner with appName
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "conduit"
Received string:    "Global FeedNo articles are here... yet.Popular Tagsreactredux"

[Killed] MethodExpression
src/components/Home/Banner.js:11:12
     <div className="banner">
       <div className="container">
         <h1 className="logo-font">
-          {appName.toLowerCase()}
+          {appName.toUpperCase()}
         </h1>
         <p>A place to share your knowledge.</p>
killedBy: Home renders banner with appName
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "conduit"
Received string:    "CONDUITA place to share your knowledge.Global FeedNo articles are here... yet.Popular Tagsreactredux"
