[Killed] BlockStatement
src/components/Home/MainView.js:7:30
 import { connect } from 'react-redux';
 import { CHANGE_TAB } from '../../constants/actionTypes';
 
-const YourFeedTab = props => {
-  if (props.token) {
-    const clickHandler = ev => {
-      ev.preventDefault();
-      props.onTabClick('feed', agent.Articles.feed, agent.Articles.feed());
-    }
-
-    return (
-      <li className="nav-item">
-        <a  href=""
-            className={ props.tab === 'feed' ? 'nav-link active' : 'nav-link' }
-            onClick={clickHandler}>
-          Your Feed
-        </a>
-      </li>
-    );
-  }
-  return null;
-};
+const YourFeedTab = props => {};
 
 const GlobalFeedTab = props => {
killedBy: App renders full app with routes when appLoaded=true
statusReason: Error: YourFeedTab(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
src/components/Home/MainView.js:8:7
 import { CHANGE_TAB } from '../../constants/actionTypes';
 
 const YourFeedTab = props => {
-  if (props.token) {
+  if (false) {
     const clickHandler = ev => {
       ev.preventDefault();
killedBy: MainView renders Your Feed tab when token is present
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Your Feed"
Received string:    "Global FeedNo articles are here... yet."

[Killed] ConditionalExpression
src/components/Home/MainView.js:8:7
 import { CHANGE_TAB } from '../../constants/actionTypes';
 
 const YourFeedTab = props => {
-  if (props.token) {
+  if (true) {
     const clickHandler = ev => {
       ev.preventDefault();
killedBy: MainView does not render Your Feed tab when no token
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Your Feed"
Received string:        "Your FeedGlobal FeedNo articles are here... yet."

[Killed] BlockStatement
src/components/Home/MainView.js:9:32
 
 const YourFeedTab = props => {
   if (props.token) {
-    const clickHandler = ev => {
-      ev.preventDefault();
-      props.onTabClick('feed', agent.Articles.feed, agent.Articles.feed());
-    }
+    const clickHandler = ev => {}
 
     return (
killedBy: MainView dispatches CHANGE_TAB with tab="feed" when Your Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "feed", "type": "CHANGE_TAB"}

Number of calls: 0

[Killed] StringLiteral
src/components/Home/MainView.js:11:24
   if (props.token) {
     const clickHandler = ev => {
       ev.preventDefault();
-      props.onTabClick('feed', agent.Articles.feed, agent.Articles.feed());
+      props.onTabClick("", agent.Articles.feed, agent.Articles.feed());
     }
 
killedBy: MainView dispatches CHANGE_TAB with tab="feed" when Your Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "feed", "type": "CHANGE_TAB"}
Received: {"pager": [Function mockConstructor], "payload": {}, "tab": "", "type": "CHANGE_TAB"}

Number of calls: 1

[Killed] EqualityOperator
src/components/Home/MainView.js:17:25
     return (
       <li className="nav-item">
         <a  href=""
-            className={ props.tab === 'feed' ? 'nav-link active' : 'nav-link' }
+            className={ props.tab !== 'feed' ? 'nav-link active' : 'nav-link' }
             onClick={clickHandler}>
           Your Feed
killedBy: MainView applies active class to Your Feed when tab=feed
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/components/Home/MainView.js:17:25
     return (
       <li className="nav-item">
         <a  href=""
-            className={ props.tab === 'feed' ? 'nav-link active' : 'nav-link' }
+            className={ true ? 'nav-link active' : 'nav-link' }
             onClick={clickHandler}>
           Your Feed
killedBy: MainView inactive tab has "nav-link" class (not empty) when tab=all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nav-link"
Received: "nav-link active"

[Killed] BlockStatement
src/components/Home/MainView.js:27:32
   return null;
 };
 
-const GlobalFeedTab = props => {
-  const clickHandler = ev => {
-    ev.preventDefault();
-    props.onTabClick('all', agent.Articles.all, agent.Articles.all());
-  };
-  return (
-    <li className="nav-item">
-      <a
-        href=""
-        className={ props.tab === 'all' ? 'nav-link active' : 'nav-link' }
-        onClick={clickHandler}>
-        Global Feed
-      </a>
-    </li>
-  );
-};
+const GlobalFeedTab = props => {};
 
 const TagFilterTab = props => {
killedBy: MainView renders global feed tab
statusReason: Error: GlobalFeedTab(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Home/MainView.js:28:30
 };
 
 const GlobalFeedTab = props => {
-  const clickHandler = ev => {
-    ev.preventDefault();
-    props.onTabClick('all', agent.Articles.all, agent.Articles.all());
-  };
+  const clickHandler = ev => {};
   return (
     <li className="nav-item">
killedBy: MainView dispatches CHANGE_TAB with tab="all" when Global Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "CHANGE_TAB"}

Number of calls: 0

[Killed] StringLiteral
src/components/Home/MainView.js:30:22
 const GlobalFeedTab = props => {
   const clickHandler = ev => {
     ev.preventDefault();
-    props.onTabClick('all', agent.Articles.all, agent.Articles.all());
+    props.onTabClick("", agent.Articles.all, agent.Articles.all());
   };
   return (
killedBy: MainView dispatches CHANGE_TAB with tab="all" when Global Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "CHANGE_TAB"}
Received: {"pager": [Function mockConstructor], "payload": {}, "tab": "", "type": "CHANGE_TAB"}

Number of calls: 1

[Killed] ConditionalExpression
src/components/Home/MainView.js:36:21
     <li className="nav-item">
       <a
         href=""
-        className={ props.tab === 'all' ? 'nav-link active' : 'nav-link' }
+        className={ true ? 'nav-link active' : 'nav-link' }
         onClick={clickHandler}>
         Global Feed
killedBy: MainView inactive tab has "nav-link" class (not empty) when tab=feed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nav-link"
Received: "nav-link active"

[Killed] EqualityOperator
src/components/Home/MainView.js:36:21
     <li className="nav-item">
       <a
         href=""
-        className={ props.tab === 'all' ? 'nav-link active' : 'nav-link' }
+        className={ props.tab !== 'all' ? 'nav-link active' : 'nav-link' }
         onClick={clickHandler}>
         Global Feed
killedBy: MainView applies active class to Global Feed when tab=all
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BlockStatement
src/components/Home/MainView.js:44:31
   );
 };
 
-const TagFilterTab = props => {
-  if (!props.tag) {
-    return null;
-  }
-
-  return (
-    <li className="nav-item">
-      <a href="" className="nav-link active">
-        <i className="ion-pound"></i> {props.tag}
-      </a>
-    </li>
-  );
-};
+const TagFilterTab = props => {};
 
 const mapStateToProps = state => ({
killedBy: MainView renders global feed tab
statusReason: Error: TagFilterTab(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Home/MainView.js:45:19
 };
 
 const TagFilterTab = props => {
-  if (!props.tag) {
-    return null;
-  }
+  if (!props.tag) {}
 
   return (
killedBy: MainView dispatches CHANGE_TAB with tab="all" when Global Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "CHANGE_TAB"}

Number of calls: 0

[Killed] ConditionalExpression
src/components/Home/MainView.js:45:7
 };
 
 const TagFilterTab = props => {
-  if (!props.tag) {
+  if (false) {
     return null;
   }
killedBy: MainView dispatches CHANGE_TAB with tab="all" when Global Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "CHANGE_TAB"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Home/MainView.js:58:25
   );
 };
 
-const mapStateToProps = state => ({
-  ...state.articleList,
-  tags: state.home.tags,
-  token: state.common.token
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = dispatch => ({
killedBy: MainView renders Your Feed tab when token is present
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Your Feed"
Received string:    "Global FeedLoading..."

[Killed] ObjectLiteral
src/components/Home/MainView.js:58:35
   );
 };
 
-const mapStateToProps = state => ({
-  ...state.articleList,
-  tags: state.home.tags,
-  token: state.common.token
-});
+const mapStateToProps = state => ({});
 
 const mapDispatchToProps = dispatch => ({
killedBy: MainView renders Your Feed tab when token is present
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Your Feed"
Received string:    "Global FeedLoading..."

[Killed] ArrowFunction
src/components/Home/MainView.js:64:28
   token: state.common.token
 });
 
-const mapDispatchToProps = dispatch => ({
-  onTabClick: (tab, pager, payload) => dispatch({ type: CHANGE_TAB, tab, pager, payload })
-});
+const mapDispatchToProps = () => undefined;
 
 const MainView = props => {
killedBy: MainView clicking Your Feed tab triggers clickHandler (covers lines 10-11)
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "props.onTabClick is not a function"

      67 |             stryCov_9fa48("288");
      68 |             ev.preventDefault();
    > 69 |             props.onTabClick(stryMutAct_9fa48("289") ? "" : (stryCov_9fa48("289"), 'feed'), agent.Articles.feed, agent.Articles.feed());

[Killed] ObjectLiteral
src/components/Home/MainView.js:64:41
   token: state.common.token
 });
 
-const mapDispatchToProps = dispatch => ({
-  onTabClick: (tab, pager, payload) => dispatch({ type: CHANGE_TAB, tab, pager, payload })
-});
+const mapDispatchToProps = dispatch => ({});
 
 const MainView = props => {
killedBy: MainView clicking Your Feed tab triggers clickHandler (covers lines 10-11)
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "props.onTabClick is not a function"

      67 |             stryCov_9fa48("288");
      68 |             ev.preventDefault();
    > 69 |             props.onTabClick(stryMutAct_9fa48("289") ? "" : (stryCov_9fa48("289"), 'feed'), agent.Articles.feed, agent.Articles.feed());

[Killed] ArrowFunction
src/components/Home/MainView.js:65:15
 });
 
 const mapDispatchToProps = dispatch => ({
-  onTabClick: (tab, pager, payload) => dispatch({ type: CHANGE_TAB, tab, pager, payload })
+  onTabClick: () => undefined
 });
 
killedBy: MainView dispatches CHANGE_TAB with tab="feed" when Your Feed is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "feed", "type": "CHANGE_TAB"}

Number of calls: 0
