[Killed] BlockStatement
src/components/Home/Tags.js:6:13
 
 const Tags = props => {
   const tags = props.tags;
-  if (tags) {
-    return (
-      <div className="tag-list">
-        {
-          tags.map(tag => {
-            const handleClick = ev => {
-              ev.preventDefault();
-              props.onClickTag(tag, page => agent.Articles.byTag(tag, page), agent.Articles.byTag(tag));
-            };
-
-            return (
-              <a
-                href=""
-                className="tag-default tag-pill"
-                key={tag}
-                onClick={handleClick}>
-                {tag}
-              </a>
-            );
-          })
-        }
-      </div>
-    );
-  } else {
+  if (tags) {} else {
     return (
       <div>Loading Tags...</div>
killedBy: App renders full app with routes when appLoaded=true
statusReason: Error: Tags(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
src/components/Home/Tags.js:6:7
 
 const Tags = props => {
   const tags = props.tags;
-  if (tags) {
+  if (false) {
     return (
       <div className="tag-list">
killedBy: Home renders tags in sidebar
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "react"
Received string:    "conduitA place to share your knowledge.Global FeedNo articles are here... yet.Popular TagsLoading Tags..."

[Killed] BlockStatement
src/components/Home/Tags.js:10:27
     return (
       <div className="tag-list">
         {
-          tags.map(tag => {
-            const handleClick = ev => {
-              ev.preventDefault();
-              props.onClickTag(tag, page => agent.Articles.byTag(tag, page), agent.Articles.byTag(tag));
-            };
-
-            return (
-              <a
-                href=""
-                className="tag-default tag-pill"
-                key={tag}
-                onClick={handleClick}>
-                {tag}
-              </a>
-            );
-          })
+          tags.map(tag => {})
         }
       </div>
killedBy: Home renders tags in sidebar
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "react"
Received string:    "conduitA place to share your knowledge.Global FeedNo articles are here... yet.Popular Tags"

[Killed] BlockStatement
src/components/Home/Tags.js:11:39
       <div className="tag-list">
         {
           tags.map(tag => {
-            const handleClick = ev => {
-              ev.preventDefault();
-              props.onClickTag(tag, page => agent.Articles.byTag(tag, page), agent.Articles.byTag(tag));
-            };
+            const handleClick = ev => {};
 
             return (
killedBy: Home clicking a tag dispatches APPLY_TAG_FILTER with correct tag
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tag": "react", "type": "APPLY_TAG_FILTER"}
Received: {"pager": [Function mockConstructor], "payload": {}, "tab": "all", "type": "HOME_PAGE_LOADED"}

Number of calls: 1

[Killed] ArrowFunction
src/components/Home/Tags.js:13:37
           tags.map(tag => {
             const handleClick = ev => {
               ev.preventDefault();
-              props.onClickTag(tag, page => agent.Articles.byTag(tag, page), agent.Articles.byTag(tag));
+              props.onClickTag(tag, () => undefined, agent.Articles.byTag(tag));
             };
 
killedBy: Tags invokes pager function passed to onClickTag
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "mytag", 0
Received
       1: "mytag"
       2: "mytag"

Number of calls: 2

[Killed] BlockStatement
src/components/Home/Tags.js:29:10
         }
       </div>
     );
-  } else {
-    return (
-      <div>Loading Tags...</div>
-    );
-  }
+  } else {}
 };
 
killedBy: Tags renders loading state when tags is falsy
statusReason: Error: Tags(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
