[Killed] ArrowFunction
src/components/Home/index.js:15:25
 
 const Promise = global.Promise;
 
-const mapStateToProps = state => ({
-  ...state.home,
-  appName: state.common.appName,
-  token: state.common.token
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = dispatch => ({
killedBy: App renders full app with routes when appLoaded=true
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ArrowFunction
src/components/Home/index.js:21:28
   token: state.common.token
 });
 
-const mapDispatchToProps = dispatch => ({
-  onClickTag: (tag, pager, payload) =>
-    dispatch({ type: APPLY_TAG_FILTER, tag, pager, payload }),
-  onLoad: (tab, pager, payload) =>
-    dispatch({ type: HOME_PAGE_LOADED, tab, pager, payload }),
-  onUnload: () =>
-    dispatch({  type: HOME_PAGE_UNLOADED })
-});
+const mapDispatchToProps = () => undefined;
 
 class Home extends React.Component {
killedBy: Home renders home page structure
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ObjectLiteral
src/components/Home/index.js:21:41
   token: state.common.token
 });
 
-const mapDispatchToProps = dispatch => ({
-  onClickTag: (tag, pager, payload) =>
-    dispatch({ type: APPLY_TAG_FILTER, tag, pager, payload }),
-  onLoad: (tab, pager, payload) =>
-    dispatch({ type: HOME_PAGE_LOADED, tab, pager, payload }),
-  onUnload: () =>
-    dispatch({  type: HOME_PAGE_UNLOADED })
-});
+const mapDispatchToProps = dispatch => ({});
 
 class Home extends React.Component {
killedBy: Home renders home page structure
statusReason: TypeError: this.props.onLoad is not a function

[Killed] ArrowFunction
src/components/Home/index.js:22:15
 });
 
 const mapDispatchToProps = dispatch => ({
-  onClickTag: (tag, pager, payload) =>
-    dispatch({ type: APPLY_TAG_FILTER, tag, pager, payload }),
+  onClickTag: () => undefined,
   onLoad: (tab, pager, payload) =>
     dispatch({ type: HOME_PAGE_LOADED, tab, pager, payload }),
killedBy: Home clicking a tag dispatches APPLY_TAG_FILTER with correct tag
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tag": "react", "type": "APPLY_TAG_FILTER"}
Received: {"pager": [Function mockConstructor], "payload": {}, "tab": "all", "type": "HOME_PAGE_LOADED"}

Number of calls: 1

[Killed] ArrowFunction
src/components/Home/index.js:24:11
 const mapDispatchToProps = dispatch => ({
   onClickTag: (tag, pager, payload) =>
     dispatch({ type: APPLY_TAG_FILTER, tag, pager, payload }),
-  onLoad: (tab, pager, payload) =>
-    dispatch({ type: HOME_PAGE_LOADED, tab, pager, payload }),
+  onLoad: () => undefined,
   onUnload: () =>
     dispatch({  type: HOME_PAGE_UNLOADED })
killedBy: Home dispatches HOME_PAGE_LOADED with tab="all" and calls agent.Tags.getAll on mount (no token)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "HOME_PAGE_LOADED"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Home/index.js:26:13
     dispatch({ type: APPLY_TAG_FILTER, tag, pager, payload }),
   onLoad: (tab, pager, payload) =>
     dispatch({ type: HOME_PAGE_LOADED, tab, pager, payload }),
-  onUnload: () =>
-    dispatch({  type: HOME_PAGE_UNLOADED })
+  onUnload: () => undefined
 });
 
killedBy: Home dispatches HOME_PAGE_UNLOADED on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "type": "HOME_PAGE_UNLOADED",
+   "pager": [Function mockConstructor],

[Killed] BlockStatement
src/components/Home/index.js:31:24
 });
 
 class Home extends React.Component {
-  componentWillMount() {
-    const tab = this.props.token ? 'feed' : 'all';
-    const articlesPromise = this.props.token ?
-      agent.Articles.feed :
-      agent.Articles.all;
-
-    this.props.onLoad(tab, articlesPromise, Promise.all([agent.Tags.getAll(), articlesPromise()]));
-  }
+  componentWillMount() {}
 
   componentWillUnmount() {
killedBy: Home dispatches HOME_PAGE_LOADED with tab="all" and calls agent.Tags.getAll on mount (no token)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "HOME_PAGE_LOADED"}

Number of calls: 0

[Killed] StringLiteral
src/components/Home/index.js:32:45
 
 class Home extends React.Component {
   componentWillMount() {
-    const tab = this.props.token ? 'feed' : 'all';
+    const tab = this.props.token ? 'feed' : "";
     const articlesPromise = this.props.token ?
       agent.Articles.feed :
killedBy: Home dispatches HOME_PAGE_LOADED with tab="all" and calls agent.Tags.getAll on mount (no token)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tab": "all", "type": "HOME_PAGE_LOADED"}
Received: {"pager": [Function mockConstructor], "payload": {}, "tab": "", "type": "HOME_PAGE_LOADED"}

Number of calls: 1

[Killed] ArrayDeclaration
src/components/Home/index.js:37:57
       agent.Articles.feed :
       agent.Articles.all;
 
-    this.props.onLoad(tab, articlesPromise, Promise.all([agent.Tags.getAll(), articlesPromise()]));
+    this.props.onLoad(tab, articlesPromise, Promise.all([]));
   }
 
killedBy: Home dispatches HOME_PAGE_LOADED with tab="all" and calls agent.Tags.getAll on mount (no token)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
