[Killed] BlockStatement
src/components/ListErrors.js:4:12
 import React from 'react';
 
 class ListErrors extends React.Component {
-  render() {
-    const errors = this.props.errors;
-    if (errors) {
-      return (
-        <ul className="error-messages">
-          {
-            Object.keys(errors).map(key => {
-              return (
-                <li key={key}>
-                  {key} {errors[key]}
-                </li>
-              );
-            })
-          }
-        </ul>
-      );
-    } else {
-      return null;
-    }
-  }
+  render() {}
 }
 
killedBy: App renders routes (Switch) when appLoaded=true, not just header
statusReason: Error: ListErrors(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
src/components/ListErrors.js:6:9
 class ListErrors extends React.Component {
   render() {
     const errors = this.props.errors;
-    if (errors) {
+    if (false) {
       return (
         <ul className="error-messages">
killedBy: Editor Component renders with errors
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/components/ListErrors.js:6:9
 class ListErrors extends React.Component {
   render() {
     const errors = this.props.errors;
-    if (errors) {
+    if (true) {
       return (
         <ul className="error-messages">
killedBy: App renders routes (Switch) when appLoaded=true, not just header
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] BlockStatement
src/components/ListErrors.js:10:44
       return (
         <ul className="error-messages">
           {
-            Object.keys(errors).map(key => {
-              return (
-                <li key={key}>
-                  {key} {errors[key]}
-                </li>
-              );
-            })
+            Object.keys(errors).map(key => {})
           }
         </ul>
killedBy: Settings renders errors when present
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "taken"
Received string:    "Your SettingsbioUpdate SettingsOr click here to logout."

[Killed] BlockStatement
src/components/ListErrors.js:20:12
           }
         </ul>
       );
-    } else {
-      return null;
-    }
+    } else {}
   }
 }
killedBy: Editor Component renders editor form with inputs
statusReason: Error: ListErrors(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
