[Killed] ArrowFunction
src/components/Register.js:12:25
   REGISTER_PAGE_UNLOADED
 } from '../constants/actionTypes';
 
-const mapStateToProps = state => ({ ...state.auth });
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = dispatch => ({
killedBy: Register shows validation errors when present
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ObjectLiteral
src/components/Register.js:12:35
   REGISTER_PAGE_UNLOADED
 } from '../constants/actionTypes';
 
-const mapStateToProps = state => ({ ...state.auth });
+const mapStateToProps = state => ({});
 
 const mapDispatchToProps = dispatch => ({
killedBy: Register shows validation errors when present
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ArrowFunction
src/components/Register.js:14:28
 
 const mapStateToProps = state => ({ ...state.auth });
 
-const mapDispatchToProps = dispatch => ({
-  onChangeEmail: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
-  onChangePassword: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
-  onChangeUsername: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
-  onSubmit: (username, email, password) => {
-    const payload = agent.Auth.register(username, email, password);
-    dispatch({ type: REGISTER, payload })
-  },
-  onUnload: () =>
-    dispatch({ type: REGISTER_PAGE_UNLOADED })
-});
+const mapDispatchToProps = () => undefined;
 
 class Register extends React.Component {
killedBy: Register submits form and calls agent.Auth.register
statusReason: TypeError: _this.props.onSubmit is not a function

[Killed] ArrowFunction
src/components/Register.js:15:18
 const mapStateToProps = state => ({ ...state.auth });
 
 const mapDispatchToProps = dispatch => ({
-  onChangeEmail: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
+  onChangeEmail: () => undefined,
   onChangePassword: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=email when email input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "email", "type": "UPDATE_FIELD_AUTH", "value": "new@email.com"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Register.js:17:21
 const mapDispatchToProps = dispatch => ({
   onChangeEmail: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
-  onChangePassword: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
+  onChangePassword: () => undefined,
   onChangeUsername: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=password when password input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "password", "type": "UPDATE_FIELD_AUTH", "value": "newpass"}

Number of calls: 0

[Killed] ObjectLiteral
src/components/Register.js:18:14
   onChangeEmail: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
   onChangePassword: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
+    dispatch({}),
   onChangeUsername: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=password when password input changes
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] StringLiteral
src/components/Register.js:18:46
   onChangeEmail: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
   onChangePassword: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
+    dispatch({ type: UPDATE_FIELD_AUTH, key: "", value }),
   onChangeUsername: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=password when password input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "password", "type": "UPDATE_FIELD_AUTH", "value": "newpass"}
Received: {"key": "", "type": "UPDATE_FIELD_AUTH", "value": "newpass"}

Number of calls: 1

[Killed] ArrowFunction
src/components/Register.js:19:21
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'email', value }),
   onChangePassword: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
-  onChangeUsername: value =>
-    dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
+  onChangeUsername: () => undefined,
   onSubmit: (username, email, password) => {
     const payload = agent.Auth.register(username, email, password);
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=username when username input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "username", "type": "UPDATE_FIELD_AUTH", "value": "newuser"}

Number of calls: 0

[Killed] BlockStatement
src/components/Register.js:21:44
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'password', value }),
   onChangeUsername: value =>
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
-  onSubmit: (username, email, password) => {
-    const payload = agent.Auth.register(username, email, password);
-    dispatch({ type: REGISTER, payload })
-  },
+  onSubmit: (username, email, password) => {},
   onUnload: () =>
     dispatch({ type: REGISTER_PAGE_UNLOADED })
killedBy: Register submits form and calls agent.Auth.register
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/components/Register.js:23:14
     dispatch({ type: UPDATE_FIELD_AUTH, key: 'username', value }),
   onSubmit: (username, email, password) => {
     const payload = agent.Auth.register(username, email, password);
-    dispatch({ type: REGISTER, payload })
+    dispatch({})
   },
   onUnload: () =>
killedBy: Register submits form and calls agent.Auth.register
statusReason: Error: Actions may not have an undefined "type" property. Have you misspelled a constant?

[Killed] ArrowFunction
src/components/Register.js:25:13
     const payload = agent.Auth.register(username, email, password);
     dispatch({ type: REGISTER, payload })
   },
-  onUnload: () =>
-    dispatch({ type: REGISTER_PAGE_UNLOADED })
+  onUnload: () => undefined
 });
 
killedBy: Register dispatches REGISTER_PAGE_UNLOADED on unmount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"type": "REGISTER_PAGE_UNLOADED"}

Number of calls: 0

[Killed] BlockStatement
src/components/Register.js:30:17
 });
 
 class Register extends React.Component {
-  constructor() {
-    super();
-    this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
-    this.changePassword = ev => this.props.onChangePassword(ev.target.value);
-    this.changeUsername = ev => this.props.onChangeUsername(ev.target.value);
-    this.submitForm = (username, email, password) => ev => {
-      ev.preventDefault();
-      this.props.onSubmit(username, email, password);
-    }
-  }
+  constructor() {}
 
   componentWillUnmount() {
killedBy: Register renders register form
statusReason: ReferenceError: this hasn't been initialised - super() hasn't been called

[Killed] ArrowFunction
src/components/Register.js:32:24
 class Register extends React.Component {
   constructor() {
     super();
-    this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
+    this.changeEmail = () => undefined;
     this.changePassword = ev => this.props.onChangePassword(ev.target.value);
     this.changeUsername = ev => this.props.onChangeUsername(ev.target.value);
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=email when email input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "email", "type": "UPDATE_FIELD_AUTH", "value": "new@email.com"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Register.js:33:27
   constructor() {
     super();
     this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
-    this.changePassword = ev => this.props.onChangePassword(ev.target.value);
+    this.changePassword = () => undefined;
     this.changeUsername = ev => this.props.onChangeUsername(ev.target.value);
     this.submitForm = (username, email, password) => ev => {
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=password when password input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "password", "type": "UPDATE_FIELD_AUTH", "value": "newpass"}

Number of calls: 0

[Killed] ArrowFunction
src/components/Register.js:34:27
     super();
     this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
     this.changePassword = ev => this.props.onChangePassword(ev.target.value);
-    this.changeUsername = ev => this.props.onChangeUsername(ev.target.value);
+    this.changeUsername = () => undefined;
     this.submitForm = (username, email, password) => ev => {
       ev.preventDefault();
killedBy: Register dispatches UPDATE_FIELD_AUTH with key=username when username input changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"key": "username", "type": "UPDATE_FIELD_AUTH", "value": "newuser"}

Number of calls: 0

[Killed] BlockStatement
src/components/Register.js:35:60
     this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
     this.changePassword = ev => this.props.onChangePassword(ev.target.value);
     this.changeUsername = ev => this.props.onChangeUsername(ev.target.value);
-    this.submitForm = (username, email, password) => ev => {
-      ev.preventDefault();
-      this.props.onSubmit(username, email, password);
-    }
+    this.submitForm = (username, email, password) => ev => {}
   }
 
killedBy: Register submits form and calls agent.Auth.register
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/components/Register.js:35:23
     this.changeEmail = ev => this.props.onChangeEmail(ev.target.value);
     this.changePassword = ev => this.props.onChangePassword(ev.target.value);
     this.changeUsername = ev => this.props.onChangeUsername(ev.target.value);
-    this.submitForm = (username, email, password) => ev => {
-      ev.preventDefault();
-      this.props.onSubmit(username, email, password);
-    }
+    this.submitForm = () => undefined
   }
 
killedBy: Register submits form and calls agent.Auth.register
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
