[Killed] ConditionalExpression
src/middleware.js:11:7
 } from './constants/actionTypes';
 
 const promiseMiddleware = store => next => action => {
-  if (isPromise(action.payload)) {
+  if (false) {
     store.dispatch({ type: ASYNC_START, subtype: action.type });
 
killedBy: promiseMiddleware dispatches ASYNC_START when payload is a promise
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"subtype": "MY_ACTION", "type": "ASYNC_START"}

Number of calls: 0

[Killed] ConditionalExpression
src/middleware.js:11:7
 } from './constants/actionTypes';
 
 const promiseMiddleware = store => next => action => {
-  if (isPromise(action.payload)) {
+  if (true) {
     store.dispatch({ type: ASYNC_START, subtype: action.type });
 
killedBy: promiseMiddleware calls next(action) when payload is NOT a promise
statusReason: TypeError: action.payload.then is not a function

[Killed] ObjectLiteral
src/middleware.js:12:20
 
 const promiseMiddleware = store => next => action => {
   if (isPromise(action.payload)) {
-    store.dispatch({ type: ASYNC_START, subtype: action.type });
+    store.dispatch({});
 
     const currentView = store.getState().viewChangeCounter;
killedBy: promiseMiddleware dispatches ASYNC_START when payload is a promise
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "subtype": "MY_ACTION",
-   "type": "ASYNC_START",

[Killed] BlockStatement
src/middleware.js:18:14
     const skipTracking = action.skipTracking;
 
     action.payload.then(
-      res => {
-        const currentState = store.getState()
-        if (!skipTracking && currentState.viewChangeCounter !== currentView) {
-          return
-        }
-        console.log('RESULT', res);
-        action.payload = res;
-        store.dispatch({ type: ASYNC_END, promise: action.payload });
-        store.dispatch(action);
-      },
+      res => {},
       error => {
         const currentState = store.getState()
killedBy: promiseMiddleware dispatches ASYNC_END and action on promise resolve
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "promise": Object {
-     "data": 42,

[Killed] ConditionalExpression
src/middleware.js:20:13
     action.payload.then(
       res => {
         const currentState = store.getState()
-        if (!skipTracking && currentState.viewChangeCounter !== currentView) {
+        if (false) {
           return
         }
killedBy: promiseMiddleware dispatches nothing on resolve when viewChangeCounter changed (skipTracking=false)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] EqualityOperator
src/middleware.js:20:30
     action.payload.then(
       res => {
         const currentState = store.getState()
-        if (!skipTracking && currentState.viewChangeCounter !== currentView) {
+        if (!skipTracking && currentState.viewChangeCounter === currentView) {
           return
         }
killedBy: promiseMiddleware dispatches ASYNC_END and action on promise resolve
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "promise": Object {
-     "data": 42,

[Killed] BlockStatement
src/middleware.js:28:16
         store.dispatch({ type: ASYNC_END, promise: action.payload });
         store.dispatch(action);
       },
-      error => {
-        const currentState = store.getState()
-        if (!skipTracking && currentState.viewChangeCounter !== currentView) {
-          return
-        }
-        console.log('ERROR', error);
-        action.error = true;
-        action.payload = error.response.body;
-        if (!action.skipTracking) {
-          store.dispatch({ type: ASYNC_END, promise: action.payload });
-        }
-        store.dispatch(action);
-      }
+      error => {}
     );
 
killedBy: promiseMiddleware sets action.error=true, dispatches ASYNC_END then action on rejection (skipTracking not set)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"promise": {"errors": {"email": ["invalid"]}}, "type": "ASYNC_END"}
Received: {"subtype": "MY_ACTION", "type": "ASYNC_START"}

Number of calls: 1

[Killed] LogicalOperator
src/middleware.js:30:13
       },
       error => {
         const currentState = store.getState()
-        if (!skipTracking && currentState.viewChangeCounter !== currentView) {
+        if (!skipTracking || currentState.viewChangeCounter !== currentView) {
           return
         }
killedBy: promiseMiddleware sets action.error=true, dispatches ASYNC_END then action on rejection (skipTracking not set)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"promise": {"errors": {"email": ["invalid"]}}, "type": "ASYNC_END"}
Received: {"subtype": "MY_ACTION", "type": "ASYNC_START"}

Number of calls: 1

[Killed] BooleanLiteral
src/middleware.js:30:13
       },
       error => {
         const currentState = store.getState()
-        if (!skipTracking && currentState.viewChangeCounter !== currentView) {
+        if (skipTracking && currentState.viewChangeCounter !== currentView) {
           return
         }
killedBy: promiseMiddleware skips dispatching on rejection when viewChangeCounter changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] BooleanLiteral
src/middleware.js:34:24
           return
         }
         console.log('ERROR', error);
-        action.error = true;
+        action.error = false;
         action.payload = error.response.body;
         if (!action.skipTracking) {
killedBy: promiseMiddleware sets action.error=true, dispatches ASYNC_END then action on rejection (skipTracking not set)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"error": true, "type": "MY_ACTION"}
Received
       1: {"subtype": "MY_ACTION", "type": "ASYNC_START"}
       2: {"promise": {"errors": {"email": ["invalid"]}}, "type": "ASYNC_END"}
       3: {"error": false, "payload": {"errors": {"email": ["invalid"]}}, "type": "MY_ACTION"}

[Killed] ConditionalExpression
src/middleware.js:36:13
         console.log('ERROR', error);
         action.error = true;
         action.payload = error.response.body;
-        if (!action.skipTracking) {
+        if (true) {
           store.dispatch({ type: ASYNC_END, promise: action.payload });
         }
killedBy: promiseMiddleware skips ASYNC_END on rejection when skipTracking=true
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalledWith(...expected)

Expected: not ObjectContaining {"type": "ASYNC_END"}
Received
       2:     {"promise": {}, "type": "ASYNC_END"}

Number of calls: 3

[Killed] BooleanLiteral
src/middleware.js:36:13
         console.log('ERROR', error);
         action.error = true;
         action.payload = error.response.body;
-        if (!action.skipTracking) {
+        if (action.skipTracking) {
           store.dispatch({ type: ASYNC_END, promise: action.payload });
         }
killedBy: promiseMiddleware sets action.error=true, dispatches ASYNC_END then action on rejection (skipTracking not set)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"promise": {"errors": {"email": ["invalid"]}}, "type": "ASYNC_END"}
Received
       1: {"subtype": "MY_ACTION", "type": "ASYNC_START"}
       2: {"error": true, "payload": {"errors": {"email": ["invalid"]}}, "type": "MY_ACTION"}

Number of calls: 2

[Killed] BlockStatement
src/middleware.js:49:59
   next(action);
 };
 
-const localStorageMiddleware = store => next => action => {
-  if (action.type === REGISTER || action.type === LOGIN) {
-    if (!action.error) {
-      window.localStorage.setItem('jwt', action.payload.user.token);
-      agent.setToken(action.payload.user.token);
-    }
-  } else if (action.type === LOGOUT) {
-    window.localStorage.setItem('jwt', '');
-    agent.setToken(null);
-  }
-
-  next(action);
-};
+const localStorageMiddleware = store => next => action => {};
 
 function isPromise(v) {
killedBy: localStorageMiddleware sets token in localStorage and agent on LOGIN without error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "jwt", "mytoken"

Number of calls: 0

[Killed] ArrowFunction
src/middleware.js:49:41
   next(action);
 };
 
-const localStorageMiddleware = store => next => action => {
-  if (action.type === REGISTER || action.type === LOGIN) {
-    if (!action.error) {
-      window.localStorage.setItem('jwt', action.payload.user.token);
-      agent.setToken(action.payload.user.token);
-    }
-  } else if (action.type === LOGOUT) {
-    window.localStorage.setItem('jwt', '');
-    agent.setToken(null);
-  }
-
-  next(action);
-};
+const localStorageMiddleware = store => () => undefined;
 
 function isPromise(v) {
killedBy: localStorageMiddleware sets token in localStorage and agent on LOGIN without error
statusReason: TypeError: (0 , _middleware.localStorageMiddleware)(...)(...) is not a function

[Killed] ConditionalExpression
src/middleware.js:50:7
 };
 
 const localStorageMiddleware = store => next => action => {
-  if (action.type === REGISTER || action.type === LOGIN) {
+  if (true) {
     if (!action.error) {
       window.localStorage.setItem('jwt', action.payload.user.token);
killedBy: localStorageMiddleware clears token on LOGOUT
statusReason: TypeError: Cannot read properties of undefined (reading 'user')

[Killed] EqualityOperator
src/middleware.js:50:35
 };
 
 const localStorageMiddleware = store => next => action => {
-  if (action.type === REGISTER || action.type === LOGIN) {
+  if (action.type === REGISTER || action.type !== LOGIN) {
     if (!action.error) {
       window.localStorage.setItem('jwt', action.payload.user.token);
killedBy: localStorageMiddleware sets token in localStorage and agent on LOGIN without error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "jwt", "mytoken"

Number of calls: 0

[Killed] BlockStatement
src/middleware.js:51:24
 
 const localStorageMiddleware = store => next => action => {
   if (action.type === REGISTER || action.type === LOGIN) {
-    if (!action.error) {
-      window.localStorage.setItem('jwt', action.payload.user.token);
-      agent.setToken(action.payload.user.token);
-    }
+    if (!action.error) {}
   } else if (action.type === LOGOUT) {
     window.localStorage.setItem('jwt', '');
killedBy: localStorageMiddleware sets token in localStorage and agent on LOGIN without error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "jwt", "mytoken"

Number of calls: 0

[Killed] ConditionalExpression
src/middleware.js:51:9
 
 const localStorageMiddleware = store => next => action => {
   if (action.type === REGISTER || action.type === LOGIN) {
-    if (!action.error) {
+    if (true) {
       window.localStorage.setItem('jwt', action.payload.user.token);
       agent.setToken(action.payload.user.token);
killedBy: localStorageMiddleware does NOT set token on LOGIN with error
statusReason: TypeError: Cannot read properties of undefined (reading 'token')

[Killed] ConditionalExpression
src/middleware.js:55:14
       window.localStorage.setItem('jwt', action.payload.user.token);
       agent.setToken(action.payload.user.token);
     }
-  } else if (action.type === LOGOUT) {
+  } else if (true) {
     window.localStorage.setItem('jwt', '');
     agent.setToken(null);
killedBy: localStorageMiddleware just calls next for unrelated actions
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "jwt", ""

[Killed] BlockStatement
src/middleware.js:55:38
       window.localStorage.setItem('jwt', action.payload.user.token);
       agent.setToken(action.payload.user.token);
     }
-  } else if (action.type === LOGOUT) {
-    window.localStorage.setItem('jwt', '');
-    agent.setToken(null);
-  }
+  } else if (action.type === LOGOUT) {}
 
   next(action);
killedBy: localStorageMiddleware clears token on LOGOUT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "jwt", ""

Number of calls: 0

[Killed] BlockStatement
src/middleware.js:63:23
   next(action);
 };
 
-function isPromise(v) {
-  return v && typeof v.then === 'function';
-}
+function isPromise(v) {}
 
 
killedBy: promiseMiddleware dispatches ASYNC_START when payload is a promise
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"subtype": "MY_ACTION", "type": "ASYNC_START"}

Number of calls: 0

[Killed] EqualityOperator
src/middleware.js:64:15
 };
 
 function isPromise(v) {
-  return v && typeof v.then === 'function';
+  return v && typeof v.then !== 'function';
 }
 
killedBy: promiseMiddleware calls next(action) when payload is NOT a promise
statusReason: TypeError: action.payload.then is not a function

[Killed] ConditionalExpression
src/middleware.js:64:10
 };
 
 function isPromise(v) {
-  return v && typeof v.then === 'function';
+  return false;
 }
 
killedBy: promiseMiddleware dispatches ASYNC_START when payload is a promise
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"subtype": "MY_ACTION", "type": "ASYNC_START"}

Number of calls: 0
