[Killed] ConditionalExpression
src/reducers/article.js:10:5
 
 export default (state = {}, action) => {
   switch (action.type) {
-    case ARTICLE_PAGE_LOADED:
-      return {
-        ...state,
-        article: action.payload[0].article,
-        comments: action.payload[1].comments
-      };
+    case ARTICLE_PAGE_LOADED:
     case ARTICLE_PAGE_UNLOADED:
       return {};
killedBy: article reducer handles ARTICLE_PAGE_LOADED
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"slug": "test", "title": "Test Article"}
Received: undefined

[Killed] ObjectLiteral
src/reducers/article.js:11:14
 export default (state = {}, action) => {
   switch (action.type) {
     case ARTICLE_PAGE_LOADED:
-      return {
-        ...state,
-        article: action.payload[0].article,
-        comments: action.payload[1].comments
-      };
+      return {};
     case ARTICLE_PAGE_UNLOADED:
       return {};
killedBy: article reducer handles ARTICLE_PAGE_LOADED
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"slug": "test", "title": "Test Article"}
Received: undefined

[Killed] ConditionalExpression
src/reducers/article.js:16:5
         article: action.payload[0].article,
         comments: action.payload[1].comments
       };
-    case ARTICLE_PAGE_UNLOADED:
-      return {};
+    case ARTICLE_PAGE_UNLOADED:
     case ADD_COMMENT:
       return {
killedBy: article reducer handles ARTICLE_PAGE_UNLOADED
statusReason: TypeError: Cannot read properties of undefined (reading 'comment')

[Killed] ConditionalExpression
src/reducers/article.js:18:5
       };
     case ARTICLE_PAGE_UNLOADED:
       return {};
-    case ADD_COMMENT:
-      return {
-        ...state,
-        commentErrors: action.error ? action.payload.errors : null,
-        comments: action.error ?
-          null :
-          (state.comments || []).concat([action.payload.comment])
-      };
+    case ADD_COMMENT:
     case DELETE_COMMENT:
       const commentId = action.commentId
killedBy: article reducer handles ADD_COMMENT success — appends comment
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
src/reducers/article.js:24:12
         commentErrors: action.error ? action.payload.errors : null,
         comments: action.error ?
           null :
-          (state.comments || []).concat([action.payload.comment])
+          (true).concat([action.payload.comment])
       };
     case DELETE_COMMENT:
killedBy: article reducer handles ADD_COMMENT success — appends comment
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).concat is not a function

[Killed] LogicalOperator
src/reducers/article.js:24:12
         commentErrors: action.error ? action.payload.errors : null,
         comments: action.error ?
           null :
-          (state.comments || []).concat([action.payload.comment])
+          (state.comments && []).concat([action.payload.comment])
       };
     case DELETE_COMMENT:
killedBy: article reducer handles ADD_COMMENT success — appends comment
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"body": "new comment", "id": 2}]

[Killed] ConditionalExpression
src/reducers/article.js:26:5
           null :
           (state.comments || []).concat([action.payload.comment])
       };
-    case DELETE_COMMENT:
-      const commentId = action.commentId
-      return {
-        ...state,
-        comments: state.comments.filter(comment => comment.id !== commentId)
-      };
+    case DELETE_COMMENT:
     default:
       return state;
killedBy: article reducer handles DELETE_COMMENT — removes correct comment
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"body": "del", "id": 1}, {"body": "keep", "id": 2}]

[Killed] ObjectLiteral
src/reducers/article.js:28:14
       };
     case DELETE_COMMENT:
       const commentId = action.commentId
-      return {
-        ...state,
-        comments: state.comments.filter(comment => comment.id !== commentId)
-      };
+      return {};
     default:
       return state;
killedBy: article reducer handles DELETE_COMMENT — removes correct comment
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] EqualityOperator
src/reducers/article.js:30:52
       const commentId = action.commentId
       return {
         ...state,
-        comments: state.comments.filter(comment => comment.id !== commentId)
+        comments: state.comments.filter(comment => comment.id === commentId)
       };
     default:
killedBy: article reducer handles DELETE_COMMENT — removes correct comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/reducers/article.js:30:52
       const commentId = action.commentId
       return {
         ...state,
-        comments: state.comments.filter(comment => comment.id !== commentId)
+        comments: state.comments.filter(comment => false)
       };
     default:
killedBy: article reducer handles DELETE_COMMENT — removes correct comment
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []
