[Killed] ConditionalExpression
src/reducers/articleList.js:18:5
 export default (state = {}, action) => {
   switch (action.type) {
     case ARTICLE_FAVORITED:
-    case ARTICLE_UNFAVORITED:
-      return {
-        ...state,
-        articles: state.articles.map(article => {
-          if (article.slug === action.payload.article.slug) {
-            return {
-              ...article,
-              favorited: action.payload.article.favorited,
-              favoritesCount: action.payload.article.favoritesCount
-            };
-          }
-          return article;
-        })
-      };
+    case ARTICLE_UNFAVORITED:
     case SET_PAGE:
       return {
killedBy: articleList reducer ARTICLE_FAVORITED / ARTICLE_UNFAVORITED updates matching article on ARTICLE_FAVORITED
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/reducers/articleList.js:21:49
     case ARTICLE_UNFAVORITED:
       return {
         ...state,
-        articles: state.articles.map(article => {
-          if (article.slug === action.payload.article.slug) {
-            return {
-              ...article,
-              favorited: action.payload.article.favorited,
-              favoritesCount: action.payload.article.favoritesCount
-            };
-          }
-          return article;
-        })
+        articles: state.articles.map(article => {})
       };
     case SET_PAGE:
killedBy: articleList reducer ARTICLE_FAVORITED / ARTICLE_UNFAVORITED updates matching article on ARTICLE_FAVORITED
statusReason: TypeError: Cannot read properties of undefined (reading 'favorited')

[Killed] ConditionalExpression
src/reducers/articleList.js:22:15
       return {
         ...state,
         articles: state.articles.map(article => {
-          if (article.slug === action.payload.article.slug) {
+          if (true) {
             return {
               ...article,
killedBy: articleList reducer ARTICLE_FAVORITED / ARTICLE_UNFAVORITED updates matching article on ARTICLE_FAVORITED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] EqualityOperator
src/reducers/articleList.js:22:15
       return {
         ...state,
         articles: state.articles.map(article => {
-          if (article.slug === action.payload.article.slug) {
+          if (article.slug !== action.payload.article.slug) {
             return {
               ...article,
killedBy: articleList reducer ARTICLE_FAVORITED / ARTICLE_UNFAVORITED updates matching article on ARTICLE_FAVORITED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/reducers/articleList.js:23:20
         ...state,
         articles: state.articles.map(article => {
           if (article.slug === action.payload.article.slug) {
-            return {
-              ...article,
-              favorited: action.payload.article.favorited,
-              favoritesCount: action.payload.article.favoritesCount
-            };
+            return {};
           }
           return article;
killedBy: articleList reducer ARTICLE_FAVORITED / ARTICLE_UNFAVORITED updates matching article on ARTICLE_FAVORITED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/reducers/articleList.js:32:5
           return article;
         })
       };
-    case SET_PAGE:
-      return {
-        ...state,
-        articles: action.payload.articles,
-        articlesCount: action.payload.articlesCount,
-        currentPage: action.page
-      };
+    case SET_PAGE:
     case APPLY_TAG_FILTER:
       return {
killedBy: articleList reducer handles SET_PAGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ObjectLiteral
src/reducers/articleList.js:33:14
         })
       };
     case SET_PAGE:
-      return {
-        ...state,
-        articles: action.payload.articles,
-        articlesCount: action.payload.articlesCount,
-        currentPage: action.page
-      };
+      return {};
     case APPLY_TAG_FILTER:
       return {
killedBy: articleList reducer handles SET_PAGE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
src/reducers/articleList.js:39:5
         articlesCount: action.payload.articlesCount,
         currentPage: action.page
       };
-    case APPLY_TAG_FILTER:
-      return {
-        ...state,
-        pager: action.pager,
-        articles: action.payload.articles,
-        articlesCount: action.payload.articlesCount,
-        tab: null,
-        tag: action.tag,
-        currentPage: 0
-      };
+    case APPLY_TAG_FILTER:
     case HOME_PAGE_LOADED:
       if (action.error) {
killedBy: articleList reducer handles APPLY_TAG_FILTER
statusReason: TypeError: Cannot read properties of undefined (reading 'tags')

[Killed] ConditionalExpression
src/reducers/articleList.js:49:5
         tag: action.tag,
         currentPage: 0
       };
-    case HOME_PAGE_LOADED:
-      if (action.error) {
-        return { ...state, tab: action.tab, currentPage: 0 };
-      }
-      return {
-        ...state,
-        pager: action.pager,
-        tags: action.payload[0].tags,
-        articles: action.payload[1].articles,
-        articlesCount: action.payload[1].articlesCount,
-        currentPage: 0,
-        tab: action.tab
-      };
+    case HOME_PAGE_LOADED:
     case HOME_PAGE_UNLOADED:
       return {};
killedBy: articleList reducer HOME_PAGE_LOADED handles HOME_PAGE_LOADED success
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["tag1"]
Received: undefined

[Killed] BlockStatement
src/reducers/articleList.js:50:25
         currentPage: 0
       };
     case HOME_PAGE_LOADED:
-      if (action.error) {
-        return { ...state, tab: action.tab, currentPage: 0 };
-      }
+      if (action.error) {}
       return {
         ...state,
killedBy: articleList reducer HOME_PAGE_LOADED handles HOME_PAGE_LOADED with error
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/reducers/articleList.js:50:11
         currentPage: 0
       };
     case HOME_PAGE_LOADED:
-      if (action.error) {
+      if (true) {
         return { ...state, tab: action.tab, currentPage: 0 };
       }
killedBy: articleList reducer HOME_PAGE_LOADED handles HOME_PAGE_LOADED success
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["tag1"]
Received: undefined

[Killed] ConditionalExpression
src/reducers/articleList.js:62:5
         currentPage: 0,
         tab: action.tab
       };
-    case HOME_PAGE_UNLOADED:
-      return {};
+    case HOME_PAGE_UNLOADED:
     case CHANGE_TAB:
       return {
killedBy: articleList reducer handles HOME_PAGE_UNLOADED
statusReason: TypeError: Cannot read properties of undefined (reading 'articles')

[Killed] ConditionalExpression
src/reducers/articleList.js:64:5
       };
     case HOME_PAGE_UNLOADED:
       return {};
-    case CHANGE_TAB:
-      return {
-        ...state,
-        pager: action.pager,
-        articles: action.payload.articles,
-        articlesCount: action.payload.articlesCount,
-        tab: action.tab,
-        currentPage: 0,
-        tag: null
-      };
+    case CHANGE_TAB:
     case PROFILE_PAGE_LOADED:
     case PROFILE_FAVORITES_PAGE_LOADED:
killedBy: articleList reducer handles CHANGE_TAB
statusReason: TypeError: Cannot read properties of undefined (reading 'articles')

[Killed] ConditionalExpression
src/reducers/articleList.js:75:5
         tag: null
       };
     case PROFILE_PAGE_LOADED:
-    case PROFILE_FAVORITES_PAGE_LOADED:
-      return {
-        ...state,
-        pager: action.pager,
-        articles: action.payload[1].articles,
-        articlesCount: action.payload[1].articlesCount,
-        currentPage: 0
-      };
+    case PROFILE_FAVORITES_PAGE_LOADED:
     case PROFILE_PAGE_UNLOADED:
     case PROFILE_FAVORITES_PAGE_UNLOADED:
killedBy: articleList reducer handles PROFILE_PAGE_LOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ObjectLiteral
src/reducers/articleList.js:76:14
       };
     case PROFILE_PAGE_LOADED:
     case PROFILE_FAVORITES_PAGE_LOADED:
-      return {
-        ...state,
-        pager: action.pager,
-        articles: action.payload[1].articles,
-        articlesCount: action.payload[1].articlesCount,
-        currentPage: 0
-      };
+      return {};
     case PROFILE_PAGE_UNLOADED:
     case PROFILE_FAVORITES_PAGE_UNLOADED:
killedBy: articleList reducer handles PROFILE_PAGE_LOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/reducers/articleList.js:84:5
         currentPage: 0
       };
     case PROFILE_PAGE_UNLOADED:
-    case PROFILE_FAVORITES_PAGE_UNLOADED:
-      return {};
+    case PROFILE_FAVORITES_PAGE_UNLOADED:
     default:
       return state;
killedBy: articleList reducer handles PROFILE_PAGE_UNLOADED
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

- Object {}
+ Object {
+   "articles": Array [],
