[Killed] ConditionalExpression
src/reducers/common.js:28:5
 
 export default (state = defaultState, action) => {
   switch (action.type) {
-    case APP_LOAD:
-      return {
-        ...state,
-        token: action.token || null,
-        appLoaded: true,
-        currentUser: action.payload ? action.payload.user : null
-      };
+    case APP_LOAD:
     case REDIRECT:
       return { ...state, redirectTo: null };
killedBy: common reducer handles APP_LOAD with token and payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "jwt-token"
Received: null

[Killed] ConditionalExpression
src/reducers/common.js:31:16
     case APP_LOAD:
       return {
         ...state,
-        token: action.token || null,
+        token: true,
         appLoaded: true,
         currentUser: action.payload ? action.payload.user : null
killedBy: common reducer handles APP_LOAD with token and payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "jwt-token"
Received: true

[Killed] LogicalOperator
src/reducers/common.js:31:16
     case APP_LOAD:
       return {
         ...state,
-        token: action.token || null,
+        token: action.token && null,
         appLoaded: true,
         currentUser: action.payload ? action.payload.user : null
killedBy: common reducer handles APP_LOAD with token and payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "jwt-token"
Received: null

[Killed] BooleanLiteral
src/reducers/common.js:32:20
       return {
         ...state,
         token: action.token || null,
-        appLoaded: true,
+        appLoaded: false,
         currentUser: action.payload ? action.payload.user : null
       };
killedBy: common reducer handles APP_LOAD with token and payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/reducers/common.js:35:5
         appLoaded: true,
         currentUser: action.payload ? action.payload.user : null
       };
-    case REDIRECT:
-      return { ...state, redirectTo: null };
+    case REDIRECT:
     case LOGOUT:
       return { ...state, redirectTo: '/', token: null, currentUser: null };
killedBy: common reducer handles REDIRECT
statusReason: Error: expect(received).toBeNull()

Received: "/"

[Killed] ConditionalExpression
src/reducers/common.js:37:5
       };
     case REDIRECT:
       return { ...state, redirectTo: null };
-    case LOGOUT:
-      return { ...state, redirectTo: '/', token: null, currentUser: null };
+    case LOGOUT:
     case ARTICLE_SUBMITTED:
       const redirectUrl = `/article/${action.payload.article.slug}`;
killedBy: common reducer handles LOGOUT
statusReason: TypeError: Cannot read properties of undefined (reading 'article')

[Killed] ConditionalExpression
src/reducers/common.js:39:5
       return { ...state, redirectTo: null };
     case LOGOUT:
       return { ...state, redirectTo: '/', token: null, currentUser: null };
-    case ARTICLE_SUBMITTED:
-      const redirectUrl = `/article/${action.payload.article.slug}`;
-      return { ...state, redirectTo: redirectUrl };
+    case ARTICLE_SUBMITTED:
     case SETTINGS_SAVED:
       return {
killedBy: common reducer handles ARTICLE_SUBMITTED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/article/my-article"
Received: "/"

[Killed] ObjectLiteral
src/reducers/common.js:41:14
       return { ...state, redirectTo: '/', token: null, currentUser: null };
     case ARTICLE_SUBMITTED:
       const redirectUrl = `/article/${action.payload.article.slug}`;
-      return { ...state, redirectTo: redirectUrl };
+      return {};
     case SETTINGS_SAVED:
       return {
killedBy: common reducer handles ARTICLE_SUBMITTED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/article/my-article"
Received: undefined

[Killed] ConditionalExpression
src/reducers/common.js:42:5
     case ARTICLE_SUBMITTED:
       const redirectUrl = `/article/${action.payload.article.slug}`;
       return { ...state, redirectTo: redirectUrl };
-    case SETTINGS_SAVED:
-      return {
-        ...state,
-        redirectTo: action.error ? null : '/',
-        currentUser: action.error ? null : action.payload.user
-      };
+    case SETTINGS_SAVED:
     case LOGIN:
     case REGISTER:
killedBy: common reducer handles SETTINGS_SAVED success
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ObjectLiteral
src/reducers/common.js:43:14
       const redirectUrl = `/article/${action.payload.article.slug}`;
       return { ...state, redirectTo: redirectUrl };
     case SETTINGS_SAVED:
-      return {
-        ...state,
-        redirectTo: action.error ? null : '/',
-        currentUser: action.error ? null : action.payload.user
-      };
+      return {};
     case LOGIN:
     case REGISTER:
killedBy: common reducer handles SETTINGS_SAVED success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: undefined

[Killed] StringLiteral
src/reducers/common.js:45:43
     case SETTINGS_SAVED:
       return {
         ...state,
-        redirectTo: action.error ? null : '/',
+        redirectTo: action.error ? null : "",
         currentUser: action.error ? null : action.payload.user
       };
killedBy: common reducer handles SETTINGS_SAVED success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: ""

[Killed] ConditionalExpression
src/reducers/common.js:49:5
         currentUser: action.error ? null : action.payload.user
       };
     case LOGIN:
-    case REGISTER:
-      return {
-        ...state,
-        redirectTo: action.error ? null : '/',
-        token: action.error ? null : action.payload.user.token,
-        currentUser: action.error ? null : action.payload.user
-      };
+    case REGISTER:
     case DELETE_ARTICLE:
       return { ...state, redirectTo: '/' };
killedBy: common reducer handles LOGIN success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "tok"
Received: null

[Killed] ConditionalExpression
src/reducers/common.js:56:5
         token: action.error ? null : action.payload.user.token,
         currentUser: action.error ? null : action.payload.user
       };
-    case DELETE_ARTICLE:
-      return { ...state, redirectTo: '/' };
+    case DELETE_ARTICLE:
     case ARTICLE_PAGE_UNLOADED:
     case EDITOR_PAGE_UNLOADED:
killedBy: common reducer handles DELETE_ARTICLE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: undefined

[Killed] ObjectLiteral
src/reducers/common.js:57:14
         currentUser: action.error ? null : action.payload.user
       };
     case DELETE_ARTICLE:
-      return { ...state, redirectTo: '/' };
+      return {};
     case ARTICLE_PAGE_UNLOADED:
     case EDITOR_PAGE_UNLOADED:
killedBy: common reducer handles DELETE_ARTICLE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: undefined

[Killed] ConditionalExpression
src/reducers/common.js:65:5
     case PROFILE_FAVORITES_PAGE_UNLOADED:
     case SETTINGS_PAGE_UNLOADED:
     case LOGIN_PAGE_UNLOADED:
-    case REGISTER_PAGE_UNLOADED:
-      return { ...state, viewChangeCounter: state.viewChangeCounter + 1 };
+    case REGISTER_PAGE_UNLOADED:
     default:
       return state;
killedBy: common reducer increments viewChangeCounter on ARTICLE_PAGE_UNLOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/reducers/common.js:66:45
     case SETTINGS_PAGE_UNLOADED:
     case LOGIN_PAGE_UNLOADED:
     case REGISTER_PAGE_UNLOADED:
-      return { ...state, viewChangeCounter: state.viewChangeCounter + 1 };
+      return { ...state, viewChangeCounter: state.viewChangeCounter - 1 };
     default:
       return state;
killedBy: common reducer increments viewChangeCounter on ARTICLE_PAGE_UNLOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ObjectLiteral
src/reducers/common.js:66:14
     case SETTINGS_PAGE_UNLOADED:
     case LOGIN_PAGE_UNLOADED:
     case REGISTER_PAGE_UNLOADED:
-      return { ...state, viewChangeCounter: state.viewChangeCounter + 1 };
+      return {};
     default:
       return state;
killedBy: common reducer increments viewChangeCounter on ARTICLE_PAGE_UNLOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
