[Killed] ConditionalExpression
src/reducers/home.js:5:5
 
 export default (state = {}, action) => {
   switch (action.type) {
-    case HOME_PAGE_LOADED:
-      if (action.error) {
-        return state;
-      }
-      return {
-        ...state,
-        tags: action.payload[0].tags
-      };
+    case HOME_PAGE_LOADED:
     case HOME_PAGE_UNLOADED:
       return {};
killedBy: home reducer handles HOME_PAGE_LOADED success
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["react", "redux"]
Received: undefined

[Killed] BlockStatement
src/reducers/home.js:6:25
 export default (state = {}, action) => {
   switch (action.type) {
     case HOME_PAGE_LOADED:
-      if (action.error) {
-        return state;
-      }
+      if (action.error) {}
       return {
         ...state,
killedBy: home reducer handles HOME_PAGE_LOADED with error — returns unchanged state
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/reducers/home.js:6:11
 export default (state = {}, action) => {
   switch (action.type) {
     case HOME_PAGE_LOADED:
-      if (action.error) {
+      if (false) {
         return state;
       }
killedBy: home reducer handles HOME_PAGE_LOADED with error — returns unchanged state
statusReason: TypeError: Cannot read properties of undefined (reading '0')
