[Killed] ConditionalExpression
src/reducers/profile.js:10:5
 
 export default (state = {}, action) => {
   switch (action.type) {
-    case PROFILE_PAGE_LOADED:
-      return {
-        ...action.payload[0].profile
-      };
+    case PROFILE_PAGE_LOADED:
     case PROFILE_PAGE_UNLOADED:
       return {};
killedBy: profile reducer handles PROFILE_PAGE_LOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user1"
Received: undefined

[Killed] ObjectLiteral
src/reducers/profile.js:11:14
 export default (state = {}, action) => {
   switch (action.type) {
     case PROFILE_PAGE_LOADED:
-      return {
-        ...action.payload[0].profile
-      };
+      return {};
     case PROFILE_PAGE_UNLOADED:
       return {};
killedBy: profile reducer handles PROFILE_PAGE_LOADED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user1"
Received: undefined

[Killed] ConditionalExpression
src/reducers/profile.js:14:5
       return {
         ...action.payload[0].profile
       };
-    case PROFILE_PAGE_UNLOADED:
-      return {};
+    case PROFILE_PAGE_UNLOADED:
     case FOLLOW_USER:
     case UNFOLLOW_USER:
killedBy: profile reducer handles PROFILE_PAGE_UNLOADED
statusReason: TypeError: Cannot read properties of undefined (reading 'profile')

[Killed] ConditionalExpression
src/reducers/profile.js:17:5
     case PROFILE_PAGE_UNLOADED:
       return {};
     case FOLLOW_USER:
-    case UNFOLLOW_USER:
-      return {
-        ...action.payload.profile
-      };
+    case UNFOLLOW_USER:
     default:
       return state;
killedBy: profile reducer handles FOLLOW_USER
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
