[Killed] ConditionalExpression
src/reducers/settings.js:9:5
 
 export default (state = {}, action) => {
   switch (action.type) {
-    case SETTINGS_SAVED:
-      return {
-        ...state,
-        inProgress: false,
-        errors: action.error ? action.payload.errors : null
-      };
+    case SETTINGS_SAVED:
     case SETTINGS_PAGE_UNLOADED:
       return {};
killedBy: settings reducer handles SETTINGS_SAVED success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ObjectLiteral
src/reducers/settings.js:10:14
 export default (state = {}, action) => {
   switch (action.type) {
     case SETTINGS_SAVED:
-      return {
-        ...state,
-        inProgress: false,
-        errors: action.error ? action.payload.errors : null
-      };
+      return {};
     case SETTINGS_PAGE_UNLOADED:
       return {};
killedBy: settings reducer handles SETTINGS_SAVED success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/reducers/settings.js:12:21
     case SETTINGS_SAVED:
       return {
         ...state,
-        inProgress: false,
+        inProgress: true,
         errors: action.error ? action.payload.errors : null
       };
killedBy: settings reducer handles SETTINGS_SAVED success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/reducers/settings.js:15:5
         inProgress: false,
         errors: action.error ? action.payload.errors : null
       };
-    case SETTINGS_PAGE_UNLOADED:
-      return {};
+    case SETTINGS_PAGE_UNLOADED:
     case ASYNC_START:
       return {
killedBy: settings reducer handles SETTINGS_PAGE_UNLOADED
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

- Object {}
+ Object {
+   "inProgress": true,

[Killed] ConditionalExpression
src/reducers/settings.js:17:5
       };
     case SETTINGS_PAGE_UNLOADED:
       return {};
-    case ASYNC_START:
-      return {
-        ...state,
-        inProgress: true
-      };
+    case ASYNC_START:
     default:
       return state;
killedBy: settings reducer handles ASYNC_START — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ObjectLiteral
src/reducers/settings.js:18:14
     case SETTINGS_PAGE_UNLOADED:
       return {};
     case ASYNC_START:
-      return {
-        ...state,
-        inProgress: true
-      };
+      return {};
     default:
       return state;
killedBy: settings reducer handles ASYNC_START — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/reducers/settings.js:20:21
     case ASYNC_START:
       return {
         ...state,
-        inProgress: true
+        inProgress: false
       };
     default:
killedBy: settings reducer handles ASYNC_START — sets inProgress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
